latexbooks/pro-git/pro-git.org
* DONE Getting Started
** Version Constrol
A system that records changes of a file or set of files.
** Evolution
1. Local Version Control Systems
2. Centralized Version Control Systems
3. Distributed Version Control Systems
		       	

** Git Basics
*** Snapshots, Not Differences
Git thinks of its data more like a set of snapshots of a miniature filesystem. Every time you commit, or save the state of your project in Git, it basically takes a picture of what all your files look like at that moment and stores a reference to that snapshot.
To be efficient, if files have not changed, Git doesn't store the file again, just a link to the previous identical file it has already stored.

*** Nearly Every Operation Is Local

*** Git Has Integrity
Everything in Git is check-sumed before it is stored and is then referred to by that checksum. The mechanism that Git uses for this checksumming is called a SHA-1 hash. In fact, Git stores everything in its database not by file name but by the hash value of it contents.

*** Git Generally Only Adds Data

*** The Three States
Git has three main states that your files can reside in:

| Name      | Meaning                                                                                                 |
|-----------+---------------------------------------------------------------------------------------------------------|
| Committed | means that the data is safely stored in your local database.                                            |
| Modified  | means that you have changed the file but have not committed it to you database yet.                     |
| Staged    | means that you have marked a modified file in its current version to go into your next commit snapshot. |

This leads us to the three main sections of a Git project:
the Git directory, working directory, and the staging area.
The Git directory is where Git stores the metadata and object database for your project. This is the most important part of Git, and it is what is copied when you clone a repository from another computer.
The working directory is a single checkout of one version of the project. These files are pulled out of the compressed database in the Git directory and placed on disk for you to use or modify.
The staging area is a file, generally contained in your Git directory, that stores information about what will go into your next commit.


