latexbooks/pro-git/pro-git.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>pro-git</title>
<!-- 2019-10-15 Tue 13:56 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Mingming Li" />
</head>
<body>
<div id="content">
<h1 class="title">pro-git</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. <span class="done DONE">DONE</span> Getting Started</a>
<ul>
<li><a href="#sec-1-1">1.1. Version Constrol</a></li>
<li><a href="#sec-1-2">1.2. Evolution</a></li>
<li><a href="#sec-1-3">1.3. Git Basics</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Snapshots, Not Differences</a></li>
<li><a href="#sec-1-3-2">1.3.2. Nearly Every Operation Is Local</a></li>
<li><a href="#sec-1-3-3">1.3.3. Git Has Integrity</a></li>
<li><a href="#sec-1-3-4">1.3.4. Git Generally Only Adds Data</a></li>
<li><a href="#sec-1-3-5">1.3.5. The Three States</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. First-Time Git Setup</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. Your Identity</a></li>
<li><a href="#sec-1-4-2">1.4.2. Your Editor</a></li>
<li><a href="#sec-1-4-3">1.4.3. Checking Your Settings</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5. Getting Help</a></li>
</ul>
</li>
<li><a href="#sec-2">2. <span class="done DONE">DONE</span> Git Basics</a>
<ul>
<li><a href="#sec-2-1">2.1. Getting a Git Repository</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. Initializing a Repository in an Existing Directory</a></li>
<li><a href="#sec-2-1-2">2.1.2. Cloning an Existing Repository</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Recording Changes to the Repository</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. Checking the Status of Your Files</a></li>
<li><a href="#sec-2-2-2">2.2.2. Tracking New Files</a></li>
<li><a href="#sec-2-2-3">2.2.3. Staging Modified Files</a></li>
<li><a href="#sec-2-2-4">2.2.4. Short Status</a></li>
<li><a href="#sec-2-2-5">2.2.5. Ignoring Files</a></li>
<li><a href="#sec-2-2-6">2.2.6. Viewing Your Staged and Unstaged Changes</a></li>
<li><a href="#sec-2-2-7">2.2.7. Committing Your Changes</a></li>
<li><a href="#sec-2-2-8">2.2.8. Skipping the Staging Area</a></li>
<li><a href="#sec-2-2-9">2.2.9. Removing Files</a></li>
<li><a href="#sec-2-2-10">2.2.10. Moving Files</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. Viewing the Commit History</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. commain options</a></li>
<li><a href="#sec-2-3-2">2.3.2. userfull option for git log &#x2013;pretty=format</a></li>
<li><a href="#sec-2-3-3">2.3.3. options to limit the output of git log</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4. Undoing Things</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1. Unstaging a Staged File</a></li>
<li><a href="#sec-2-4-2">2.4.2. Unmodifying a Modified File</a></li>
</ul>
</li>
<li><a href="#sec-2-5">2.5. Working with Remotes</a>
<ul>
<li><a href="#sec-2-5-1">2.5.1. Showing Your Remotes</a></li>
<li><a href="#sec-2-5-2">2.5.2. Fetching and Pulling from Your Remotes</a></li>
<li><a href="#sec-2-5-3">2.5.3. Pushing to Your Remotes</a></li>
<li><a href="#sec-2-5-4">2.5.4. Inspecting a Rmote</a></li>
<li><a href="#sec-2-5-5">2.5.5. Removing and Renaming Remotes</a></li>
</ul>
</li>
<li><a href="#sec-2-6">2.6. Tagging</a>
<ul>
<li><a href="#sec-2-6-1">2.6.1. Listing Your Tags</a></li>
<li><a href="#sec-2-6-2">2.6.2. Creating Tags</a></li>
<li><a href="#sec-2-6-3">2.6.3. Tagging Later</a></li>
<li><a href="#sec-2-6-4">2.6.4. Sharing Tags</a></li>
</ul>
</li>
<li><a href="#sec-2-7">2.7. Git Aliases</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Git Branching</a>
<ul>
<li><a href="#sec-3-1">3.1. Branching in a Nutshell</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. Creating a New Branch</a></li>
<li><a href="#sec-3-1-2">3.1.2. Switching Branches</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2. Basic Branching and Merging</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. Basic Branching</a></li>
<li><a href="#sec-3-2-2">3.2.2. Basic Merging</a></li>
<li><a href="#sec-3-2-3">3.2.3. Basic Merge Conflicts</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3. Branch Management</a></li>
<li><a href="#sec-3-4">3.4. Branching Workflows</a>
<ul>
<li><a href="#sec-3-4-1">3.4.1. Long-Running Branches</a></li>
<li><a href="#sec-3-4-2">3.4.2. Topic Branches</a></li>
</ul>
</li>
<li><a href="#sec-3-5">3.5. Remote Branches</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1. Pushing</a></li>
<li><a href="#sec-3-5-2">3.5.2. Tracking Branches</a></li>
<li><a href="#sec-3-5-3">3.5.3. Pulling</a></li>
<li><a href="#sec-3-5-4">3.5.4. Deleting Remote Branches</a></li>
</ul>
</li>
<li><a href="#sec-3-6">3.6. Rebasing</a>
<ul>
<li><a href="#sec-3-6-1">3.6.1. The Basic Rebase</a></li>
<li><a href="#sec-3-6-2">3.6.2. More Interesting Rebases</a></li>
<li><a href="#sec-3-6-3">3.6.3. Rebase vs. Merge</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. Git on the Server</a>
<ul>
<li><a href="#sec-4-1">4.1. The Protocols</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. Local Protocol</a></li>
<li><a href="#sec-4-1-2">4.1.2. The Http Protocols</a></li>
<li><a href="#sec-4-1-3">4.1.3. The SSH Protocol</a></li>
<li><a href="#sec-4-1-4">4.1.4. The Git Protocol</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2. Getting Git on a Server</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1. First, get a bare repository</a></li>
<li><a href="#sec-4-2-2">4.2.2. Second, copy it to a server</a></li>
<li><a href="#sec-4-2-3">4.2.3. note</a></li>
<li><a href="#sec-4-2-4">4.2.4. Small Setups</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3. Setting Up the Server</a></li>
<li><a href="#sec-4-4">4.4. Git Daemon</a></li>
<li><a href="#sec-4-5">4.5. Smart HTTP (not done)</a>
<ul>
<li><a href="#sec-4-5-1">4.5.1. Ubuntu</a></li>
<li><a href="#sec-4-5-2">4.5.2. CentOS</a></li>
</ul>
</li>
<li><a href="#sec-4-6">4.6. GitLab</a>
<ul>
<li><a href="#sec-4-6-1">4.6.1. Install</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="done DONE">DONE</span> Getting Started</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Version Constrol</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A system that records changes of a file or set of files.<br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Evolution</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Local Version Control Systems<br  />
</li>
<li>Centralized Version Control Systems<br  />
</li>
<li>Distributed Version Control Systems<br  />
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Git Basics</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Snapshots, Not Differences</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Git thinks of its data more like a set of snapshots of a miniature filesystem. Every time you commit, or save the state of your project in Git, it basically takes a picture of what all your files look like at that moment and stores a reference to that snapshot.<br  />
To be efficient, if files have not changed, Git doesn't store the file again, just a link to the previous identical file it has already stored.<br  />
</p>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Nearly Every Operation Is Local</h4>
</div>

<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> Git Has Integrity</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
Everything in Git is check-sumed before it is stored and is then referred to by that checksum. The mechanism that Git uses for this checksumming is called a SHA-1 hash. In fact, Git stores everything in its database not by file name but by the hash value of it contents.<br  />
</p>
</div>
</div>

<div id="outline-container-sec-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> Git Generally Only Adds Data</h4>
</div>

<div id="outline-container-sec-1-3-5" class="outline-4">
<h4 id="sec-1-3-5"><span class="section-number-4">1.3.5</span> The Three States</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
Git has three main states that your files can reside in:<br  />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Name</th>
<th scope="col" class="left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Committed</td>
<td class="left">means that the data is safely stored in your local database.</td>
</tr>

<tr>
<td class="left">Modified</td>
<td class="left">means that you have changed the file but have not committed it to you database yet.</td>
</tr>

<tr>
<td class="left">Staged</td>
<td class="left">means that you have marked a modified file in its current version to go into your next commit snapshot.</td>
</tr>
</tbody>
</table>

<p>
This leads us to the three main sections of a Git project:<br  />
the Git directory, working directory, and the staging area.<br  />
The Git directory is where Git stores the metadata and object database for your project. This is the most important part of Git, and it is what is copied when you clone a repository from another computer.<br  />
The working directory is a single checkout of one version of the project. These files are pulled out of the compressed database in the Git directory and placed on disk for you to use or modify.<br  />
The staging area is a file, generally contained in your Git directory, that stores information about what will go into your next commit.<br  />
</p>
</div>
</div>
</div>
