latexbooks/pro-git/pro-git.tex
% Created 2022-04-10 Sun 15:27
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Mingming Li}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Mingming Li},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}

\begin{document}

\tableofcontents

\section{{\bfseries\sffamily DONE} Getting Started}
\label{sec:org6dbc28c}
\subsection{Version Constrol}
\label{sec:org907cdb0}
A system that records changes of a file or set of files.\\
\subsection{Evolution}
\label{sec:org3e83215}
\begin{enumerate}
\item Local Version Control Systems\\
\item Centralized Version Control Systems\\
\item Distributed Version Control Systems\\
\end{enumerate}


\subsection{Git Basics}
\label{sec:org369b067}
\subsubsection{Snapshots, Not Differences}
\label{sec:org75b66ea}
Git thinks of its data more like a set of snapshots of a miniature filesystem. Every time you commit, or save the state of your project in Git, it basically takes a picture of what all your files look like at that moment and stores a reference to that snapshot.\\
To be efficient, if files have not changed, Git doesn't store the file again, just a link to the previous identical file it has already stored.\\

\subsubsection{Nearly Every Operation Is Local}
\label{sec:orgac383b4}

\subsubsection{Git Has Integrity}
\label{sec:orgdb40209}
Everything in Git is check-sumed before it is stored and is then referred to by that checksum. The mechanism that Git uses for this checksumming is called a SHA-1 hash. In fact, Git stores everything in its database not by file name but by the hash value of it contents.\\

\subsubsection{Git Generally Only Adds Data}
\label{sec:org3cf22ec}

\subsubsection{The Three States}
\label{sec:org7e4403b}
Git has three main states that your files can reside in:\\

\begin{center}
\begin{tabular}{ll}
Name & Meaning\\
\hline
Committed & means that the data is safely stored in your local database.\\
Modified & means that you have changed the file but have not committed it to you database yet.\\
Staged & means that you have marked a modified file in its current version to go into your next commit snapshot.\\
\end{tabular}
\end{center}

This leads us to the three main sections of a Git project:\\
the Git directory, working directory, and the staging area.\\
The Git directory is where Git stores the metadata and object database for your project. This is the most important part of Git, and it is what is copied when you clone a repository from another computer.\\
The working directory is a single checkout of one version of the project. These files are pulled out of the compressed database in the Git directory and placed on disk for you to use or modify.\\
The staging area is a file, generally contained in your Git directory, that stores information about what will go into your next commit.\\
