latexbooks/pro-git/pro-git.org
** First-Time Git Setup
Git comes with a tool called "git config" that lets you get and set configuration variables that control all aspects of how Git looks and operates.
These variables can be stored in three different places:
1. /etc/gitconfig file: Contains values for every user on the system and all their repositories. If you pass the option --system to git config, it reads and writes from this file specifically.
2. ~/.gitconfig or ~/.config/git/config file: Specific to your user. You can make git read and write to this file specifically by passing the --global option.
3. config file in the Git directory (that is, .git/config) of whatever repository you're currently using: Specific to that single repository.

Each level overrides values in the previous level.

*** Your Identity
git config --global user.name "Michael Chyson"
git config --global user.email chyson@aliyun.com

*** Your Editor
git config --global core.editor emacs

*** Checking Your Settings
git config --list
git config user.name

** Getting Help
#+BEGIN_SRC sh
man git
git <cammand> -h  # simple information help
git <command> --help  # verbose information help
#+END_SRC



* DONE Git Basics
** Getting a Git Repository
*** Initializing a Repository in an Existing Directory
git init

#+BEGIN_SRC sh
git init -h
#+END_SRC

This creates a new subdirectory named .git that contains all of your necessary repository files -- a Git repository skeleton.

*** Cloning an Existing Repository
git clone https://github.com/libgit2/libgit2

That creates a directory named "libgit2", initializes a .git directory inside it, pulls down all the data for that repository, and checks out a working copy of the latest version.

git clone https://github.com/libgit2/libgit2 mylibgit

The target directory is called mylibgit.

** Recording Changes to the Repository
Each file in your directory can be in one of two states: tracked or untracked.
Tracked files are files that were in the last snapshot; they can be unmodified, modified, or staged.
Untracked files are everyhting else -- any files in your directory that were not in your last snapshot and are not in your staging area.

*** Checking the Status of Your Files
git status
#+BEGIN_SRC sh
git status -h
#+END_SRC

*** Tracking New Files
git add <file>
git add *
#+BEGIN_SRC sh
git add -h
#+END_SRC
The git add command takes a path name for either a file or a directory; if it's a directory, the command adds all the files in that directory recursively.

*** Staging Modified Files
git add <file>


*** Short Status
git status -s
git status --short

new files that aren't tracked have a ?? next to them;
new files that have been added to the staging area have an A;
modified files have an M;


*** Ignoring Files
emacs .gitignore (in the project directory)
(or .git/info/exclude)


*** Viewing Your Staged and Unstaged Changes
git diff

This command compares what is in your working directory with what is in your staging area.

to see what you've staged that will go into your next commit, you can use:
git diff --staged

This command compares your staged changes to your last commit.

*** Committing Your Changes
#+BEGIN_SRC sh
git commit
git commit -h
#+END_SRC

For an even more explicit reminder of what you've modified, you can pass the -v option to git commit. 
Doing so also puts the diff of you change in the editor so you can see exactly what changes you're committing:
#+BEGIN_SRC sh
git commit -v
#+END_SRC

you can type your commit message inline:
#+BEGIN_SRC sh
git commit -m "Story 182: Fix benchmarks for speed"
#+END_SRC


