latexbooks/pro-git/pro-git.html


<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> First-Time Git Setup</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Git comes with a tool called "git config" that lets you get and set configuration variables that control all aspects of how Git looks and operates.<br  />
These variables can be stored in three different places:<br  />
</p>
<ol class="org-ol">
<li>/etc/gitconfig file: Contains values for every user on the system and all their repositories. If you pass the option &#x2013;system to git config, it reads and writes from this file specifically.<br  />
</li>
<li>~/.gitconfig or ~/.config/git/config file: Specific to your user. You can make git read and write to this file specifically by passing the &#x2013;global option.<br  />
</li>
<li>config file in the Git directory (that is, .git/config) of whatever repository you're currently using: Specific to that single repository.<br  />
</li>
</ol>

<p>
Each level overrides values in the previous level.<br  />
</p>
</div>

<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> Your Identity</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
git config &#x2013;global user.name "Michael Chyson"<br  />
git config &#x2013;global user.email chyson@aliyun.com<br  />
</p>
</div>
</div>

<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> Your Editor</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
git config &#x2013;global core.editor emacs<br  />
</p>
</div>
</div>

<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> Checking Your Settings</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
git config &#x2013;list<br  />
git config user.name<br  />
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Getting Help</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-sh">man git
git &lt;cammand&gt; -h  # simple information help
git &lt;command&gt; --help  # verbose information help
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <span class="done DONE">DONE</span> Git Basics</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Getting a Git Repository</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Initializing a Repository in an Existing Directory</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
git init<br  />
</p>

<div class="org-src-container">

<pre class="src src-sh">git init -h
</pre>
</div>

<p>
This creates a new subdirectory named .git that contains all of your necessary repository files &#x2013; a Git repository skeleton.<br  />
</p>
</div>
</div>

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Cloning an Existing Repository</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
git clone <a href="https://github.com/libgit2/libgit2">https://github.com/libgit2/libgit2</a><br  />
</p>

<p>
That creates a directory named "libgit2", initializes a .git directory inside it, pulls down all the data for that repository, and checks out a working copy of the latest version.<br  />
</p>

<p>
git clone <a href="https://github.com/libgit2/libgit2">https://github.com/libgit2/libgit2</a> mylibgit<br  />
</p>

<p>
The target directory is called mylibgit.<br  />
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Recording Changes to the Repository</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Each file in your directory can be in one of two states: tracked or untracked.<br  />
Tracked files are files that were in the last snapshot; they can be unmodified, modified, or staged.<br  />
Untracked files are everyhting else &#x2013; any files in your directory that were not in your last snapshot and are not in your staging area.<br  />
</p>
</div>

<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Checking the Status of Your Files</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
git status<br  />
</p>
<div class="org-src-container">

<pre class="src src-sh">git status -h
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Tracking New Files</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
git add &lt;file&gt;<br  />
git add *<br  />
</p>
<div class="org-src-container">

<pre class="src src-sh">git add -h
</pre>
</div>
<p>
The git add command takes a path name for either a file or a directory; if it's a directory, the command adds all the files in that directory recursively.<br  />
</p>
</div>
</div>

<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> Staging Modified Files</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
git add &lt;file&gt;<br  />
</p>
</div>
</div>


<div id="outline-container-sec-2-2-4" class="outline-4">
<h4 id="sec-2-2-4"><span class="section-number-4">2.2.4</span> Short Status</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
git status -s<br  />
git status &#x2013;short<br  />
</p>

<p>
new files that aren't tracked have a ?? next to them;<br  />
new files that have been added to the staging area have an A;<br  />
modified files have an M;<br  />
</p>
</div>
</div>


<div id="outline-container-sec-2-2-5" class="outline-4">
<h4 id="sec-2-2-5"><span class="section-number-4">2.2.5</span> Ignoring Files</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
emacs .gitignore (in the project directory)<br  />
(or .git/info/exclude)<br  />
</p>
</div>
</div>


<div id="outline-container-sec-2-2-6" class="outline-4">
<h4 id="sec-2-2-6"><span class="section-number-4">2.2.6</span> Viewing Your Staged and Unstaged Changes</h4>
<div class="outline-text-4" id="text-2-2-6">
<p>
git diff<br  />
</p>

<p>
This command compares what is in your working directory with what is in your staging area.<br  />
</p>

<p>
to see what you've staged that will go into your next commit, you can use:<br  />
git diff &#x2013;staged<br  />
</p>

<p>
This command compares your staged changes to your last commit.<br  />
</p>
</div>
</div>

<div id="outline-container-sec-2-2-7" class="outline-4">
<h4 id="sec-2-2-7"><span class="section-number-4">2.2.7</span> Committing Your Changes</h4>
<div class="outline-text-4" id="text-2-2-7">
<div class="org-src-container">

<pre class="src src-sh">git commit
git commit -h
</pre>
</div>

<p>
For an even more explicit reminder of what you've modified, you can pass the -v option to git commit.<br  />
Doing so also puts the diff of you change in the editor so you can see exactly what changes you're committing:<br  />
</p>
<div class="org-src-container">

<pre class="src src-sh">git commit -v
</pre>
</div>

<p>
you can type your commit message inline:<br  />
</p>
<div class="org-src-container">

<pre class="src src-sh">git commit -m "Story 182: Fix benchmarks for speed"
</pre>
</div>
</div>
</div>
