latexbooks/pro-git/pro-git.tex


\subsection{First-Time Git Setup}
\label{sec:org94c77e6}
Git comes with a tool called "git config" that lets you get and set configuration variables that control all aspects of how Git looks and operates.\\
These variables can be stored in three different places:\\
\begin{enumerate}
\item /etc/gitconfig file: Contains values for every user on the system and all their repositories. If you pass the option --system to git config, it reads and writes from this file specifically.\\
\item \textasciitilde{}/.gitconfig or \textasciitilde{}/.config/git/config file: Specific to your user. You can make git read and write to this file specifically by passing the --global option.\\
\item config file in the Git directory (that is, .git/config) of whatever repository you're currently using: Specific to that single repository.\\
\end{enumerate}

Each level overrides values in the previous level.\\

\subsubsection{Your Identity}
\label{sec:org2e85862}
git config --global user.name "Michael Chyson"\\
git config --global user.email chyson@aliyun.com\\

\subsubsection{Your Editor}
\label{sec:orgf15ba56}
git config --global core.editor emacs\\

\subsubsection{Checking Your Settings}
\label{sec:org2a169d4}
git config --list\\
git config user.name\\

\subsection{Getting Help}
\label{sec:orgd6fa561}
\begin{verbatim}
man git
git <cammand> -h  # simple information help
git <command> --help  # verbose information help
\end{verbatim}



\section{{\bfseries\sffamily DONE} Git Basics}
\label{sec:org53bc411}
\subsection{Getting a Git Repository}
\label{sec:orge38dcba}
\subsubsection{Initializing a Repository in an Existing Directory}
\label{sec:orga3ef533}
git init

\begin{verbatim}
git init -h
\end{verbatim}

This creates a new subdirectory named .git that contains all of your necessary repository files -- a Git repository skeleton.\\

\subsubsection{Cloning an Existing Repository}
\label{sec:org407443e}
git clone \url{https://github.com/libgit2/libgit2}\\

That creates a directory named "libgit2", initializes a .git directory inside it, pulls down all the data for that repository, and checks out a working copy of the latest version.\\

git clone \url{https://github.com/libgit2/libgit2} mylibgit\\

The target directory is called mylibgit.\\

\subsection{Recording Changes to the Repository}
\label{sec:orgae728fd}
Each file in your directory can be in one of two states: tracked or untracked.\\
Tracked files are files that were in the last snapshot; they can be unmodified, modified, or staged.\\
Untracked files are everyhting else -- any files in your directory that were not in your last snapshot and are not in your staging area.\\

\subsubsection{Checking the Status of Your Files}
\label{sec:org5a0a6bd}
git status\\
\begin{verbatim}
git status -h
\end{verbatim}

\subsubsection{Tracking New Files}
\label{sec:orgdf4a0ba}
git add <file>\\
git add *\\
\begin{verbatim}
git add -h
\end{verbatim}
The git add command takes a path name for either a file or a directory; if it's a directory, the command adds all the files in that directory recursively.\\

\subsubsection{Staging Modified Files}
\label{sec:org7084704}
git add <file>\\


\subsubsection{Short Status}
\label{sec:org201d1c0}
git status -s\\
git status --short\\

new files that aren't tracked have a ?? next to them;\\
new files that have been added to the staging area have an A;\\
modified files have an M;\\


\subsubsection{Ignoring Files}
\label{sec:org6096ad6}
emacs .gitignore (in the project directory)\\
(or .git/info/exclude)\\


\subsubsection{Viewing Your Staged and Unstaged Changes}
\label{sec:org8badc20}
git diff\\

This command compares what is in your working directory with what is in your staging area.\\

to see what you've staged that will go into your next commit, you can use:\\
git diff --staged\\

This command compares your staged changes to your last commit.\\

\subsubsection{Committing Your Changes}
\label{sec:org561d2f8}
\begin{verbatim}
git commit
git commit -h
\end{verbatim}

For an even more explicit reminder of what you've modified, you can pass the -v option to git commit.\\
Doing so also puts the diff of you change in the editor so you can see exactly what changes you're committing:\\
\begin{verbatim}
git commit -v
\end{verbatim}

you can type your commit message inline:\\
\begin{verbatim}
git commit -m "Story 182: Fix benchmarks for speed"
\end{verbatim}
