latexbooks/pro-git/pro-git.org
*** Skipping the Staging Area
If you want to skip the staging area, adding the -a option to the git commit command makes Git automatically stage every file that is already tracked before doing the commit, letting you skip the git add part:
#+BEGIN_SRC sh
git commit -a
#+END_SRC


*** Removing Files
#+BEGIN_SRC sh
git rm <file>
git rm -h
#+END_SRC

remove a file from your tracked files and removes the file from your working directory.

If you modified the file and added it to the index already, you must force the removal with the -f option:
git rm -f <file>

to keep the file in your working tree but remove it from your staging area:
git rm --cached <file>


*** Moving Files
Git doesn't explicitly track file movement.
If you rename a file in Git, no metadata is stored in Git that tells it you renamed the file.
However, Git is pretty smart about figuring that out after the fact.

If you want to rename a file in Git:
git mv <file_from> <file_to>

is same as:
mv <file_from> <file_to>
git rm <file_from>
git add <file_to>


** Viewing the Commit History
The most basic and powerful tool to see what has happened:
#+BEGIN_SRC sh
git log
git log -h
git log --help
#+END_SRC

By default, with no argument, git log lists the commit made in that repository in reverse chronological order.

*** commain options
| Options  | Meaning                                                              |
|----------+----------------------------------------------------------------------|
| -p       | shows the difference introduced in each commit (patch)               |
| -2       | limits the output to only the last two entries                       |
| --stat   | to see some abbreviated stats for each commit                        |
| --pretty | change the log output to formats other than the default              |
| --graph  | adds a nice little ASCII graph showing your branch and merge history |

#+BEGIN_SRC sh
git log --pretty=oneline
#+END_SRC


The most interesting option is format, which allows you to specify your own log output format. This is especially useful when you're generating output for machine parsing.
#+BEGIN_SRC sh
git log --pretty=format:"%h - %an, %ar : %s"
#+END_SRC


*** userfull option for git log --pretty=format
(lowercase: abbreviated)
+-----+-----------------------------------+
|%H   |commit hash                        |
+-----+-----------------------------------+
|%h   |abbreviated commit hash            |
+-----+-----------------------------------+
|%T   |tree hash                          |
+-----+-----------------------------------+
|%t   |abbreviated tree hash              |
+-----+-----------------------------------+
|%P   |parent hashes                      |
+-----+-----------------------------------+
|%p   |abbreviated parent hashes          |
+-----+-----------------------------------+
|%an  |author name                        |
+-----+-----------------------------------+
|%ae  |author email                       |
+-----+-----------------------------------+
|%ad  |author date                        |
+-----+-----------------------------------+
|%ar  |author date, relative              |
+-----+-----------------------------------+
|%cn  |commit name                        |
+-----+-----------------------------------+
|%ce  |commite email                      |
+-----+-----------------------------------+
|%cd  |commit date                        |
+-----+-----------------------------------+
|%cr  |commit date, relative              |
+-----+-----------------------------------+
|%s   |subject                            |
+-----+-----------------------------------+

The author is the person who originally wrote the work, whereas the commiter is the person who last applied the work.


