latexbooks/pro-git/pro-git.html


<div id="outline-container-sec-2-2-8" class="outline-4">
<h4 id="sec-2-2-8"><span class="section-number-4">2.2.8</span> Skipping the Staging Area</h4>
<div class="outline-text-4" id="text-2-2-8">
<p>
If you want to skip the staging area, adding the -a option to the git commit command makes Git automatically stage every file that is already tracked before doing the commit, letting you skip the git add part:<br  />
</p>
<div class="org-src-container">

<pre class="src src-sh">git commit -a
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-2-9" class="outline-4">
<h4 id="sec-2-2-9"><span class="section-number-4">2.2.9</span> Removing Files</h4>
<div class="outline-text-4" id="text-2-2-9">
<div class="org-src-container">

<pre class="src src-sh">git rm &lt;file&gt;
git rm -h
</pre>
</div>

<p>
remove a file from your tracked files and removes the file from your working directory.<br  />
</p>

<p>
If you modified the file and added it to the index already, you must force the removal with the -f option:<br  />
git rm -f &lt;file&gt;<br  />
</p>

<p>
to keep the file in your working tree but remove it from your staging area:<br  />
git rm &#x2013;cached &lt;file&gt;<br  />
</p>
</div>
</div>


<div id="outline-container-sec-2-2-10" class="outline-4">
<h4 id="sec-2-2-10"><span class="section-number-4">2.2.10</span> Moving Files</h4>
<div class="outline-text-4" id="text-2-2-10">
<p>
Git doesn't explicitly track file movement.<br  />
If you rename a file in Git, no metadata is stored in Git that tells it you renamed the file.<br  />
However, Git is pretty smart about figuring that out after the fact.<br  />
</p>

<p>
If you want to rename a file in Git:<br  />
git mv &lt;file_from&gt; &lt;file_to&gt;<br  />
</p>

<p>
is same as:<br  />
mv &lt;file_from&gt; &lt;file_to&gt;<br  />
git rm &lt;file_from&gt;<br  />
git add &lt;file_to&gt;<br  />
</p>
</div>
</div>
</div>


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Viewing the Commit History</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The most basic and powerful tool to see what has happened:<br  />
</p>
<div class="org-src-container">

<pre class="src src-sh">git log
git log -h
git log --help
</pre>
</div>

<p>
By default, with no argument, git log lists the commit made in that repository in reverse chronological order.<br  />
</p>
</div>

<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> commain options</h4>
<div class="outline-text-4" id="text-2-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Options</th>
<th scope="col" class="left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">-p</td>
<td class="left">shows the difference introduced in each commit (patch)</td>
</tr>

<tr>
<td class="left">-2</td>
<td class="left">limits the output to only the last two entries</td>
</tr>

<tr>
<td class="left">&#x2013;stat</td>
<td class="left">to see some abbreviated stats for each commit</td>
</tr>

<tr>
<td class="left">&#x2013;pretty</td>
<td class="left">change the log output to formats other than the default</td>
</tr>

<tr>
<td class="left">&#x2013;graph</td>
<td class="left">adds a nice little ASCII graph showing your branch and merge history</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-sh">git log --pretty=oneline
</pre>
</div>


<p>
The most interesting option is format, which allows you to specify your own log output format. This is especially useful when you're generating output for machine parsing.<br  />
</p>
<div class="org-src-container">

<pre class="src src-sh">git log --pretty=format:"%h - %an, %ar : %s"
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> userfull option for git log &#x2013;pretty=format</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
(lowercase: abbreviated)<br  />
</p>
<!-- This HTML table template is generated by emacs 25.2.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      %H&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      commit&nbsp;hash&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      %h&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      abbreviated&nbsp;commit&nbsp;hash&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      %T&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      tree&nbsp;hash&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      %t&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      abbreviated&nbsp;tree&nbsp;hash&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      %P&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      parent&nbsp;hashes&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      %p&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      abbreviated&nbsp;parent&nbsp;hashes&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      %an&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      author&nbsp;name&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      %ae&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      author&nbsp;email&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      %ad&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      author&nbsp;date&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      %ar&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      author&nbsp;date,&nbsp;relative&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      %cn&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      commit&nbsp;name&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      %ce&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      commite&nbsp;email&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      %cd&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      commit&nbsp;date&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      %cr&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      commit&nbsp;date,&nbsp;relative&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      %s&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      subject&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
</table>

<p>
The author is the person who originally wrote the work, whereas the commiter is the person who last applied the work.<br  />
</p>
</div>
</div>
