latexbooks/pro-git/pro-git.tex


\subsubsection{Skipping the Staging Area}
\label{sec:orgdda6f58}
If you want to skip the staging area, adding the -a option to the git commit command makes Git automatically stage every file that is already tracked before doing the commit, letting you skip the git add part:\\
\begin{verbatim}
git commit -a
\end{verbatim}


\subsubsection{Removing Files}
\label{sec:org45f1de3}
\begin{verbatim}
git rm <file>
git rm -h
\end{verbatim}

remove a file from your tracked files and removes the file from your working directory.\\

If you modified the file and added it to the index already, you must force the removal with the -f option:\\
git rm -f <file>\\

to keep the file in your working tree but remove it from your staging area:\\
git rm --cached <file>\\


\subsubsection{Moving Files}
\label{sec:org52c3fe1}
Git doesn't explicitly track file movement.\\
If you rename a file in Git, no metadata is stored in Git that tells it you renamed the file.\\
However, Git is pretty smart about figuring that out after the fact.\\

If you want to rename a file in Git:\\
git mv <file\_from> <file\_to>\\

is same as:\\
mv <file\_from> <file\_to>\\
git rm <file\_from>\\
git add <file\_to>\\


\subsection{Viewing the Commit History}
\label{sec:orgd647cac}
The most basic and powerful tool to see what has happened:\\
\begin{verbatim}
git log
git log -h
git log --help
\end{verbatim}

By default, with no argument, git log lists the commit made in that repository in reverse chronological order.\\

\subsubsection{commain options}
\label{sec:org9db2588}
\begin{center}
\begin{tabular}{ll}
Options & Meaning\\
\hline
-p & shows the difference introduced in each commit (patch)\\
-2 & limits the output to only the last two entries\\
--stat & to see some abbreviated stats for each commit\\
--pretty & change the log output to formats other than the default\\
--graph & adds a nice little ASCII graph showing your branch and merge history\\
\end{tabular}
\end{center}

\begin{verbatim}
git log --pretty=oneline
\end{verbatim}


The most interesting option is format, which allows you to specify your own log output format. This is especially useful when you're generating output for machine parsing.\\
\begin{verbatim}
git log --pretty=format:"%h - %an, %ar : %s"
\end{verbatim}


\subsubsection{userfull option for git log --pretty=format}
\label{sec:orgaacbc63}
(lowercase: abbreviated)\\
\begin{center}
\begin{tabular}{|l|l|}
\hline
\%H & commit hash \\
\hline
\%h & abbreviated commit hash \\
\hline
\%T & tree hash \\
\hline
\%t & abbreviated tree hash \\
\hline
\%P & parent hashes \\
\hline
\%p & abbreviated parent hashes \\
\hline
\%an & author name \\
\hline
\%ae & author email \\
\hline
\%ad & author date \\
\hline
\%ar & author date, relative \\
\hline
\%cn & commit name \\
\hline
\%ce & commite email \\
\hline
\%cd & commit date \\
\hline
\%cr & commit date, relative \\
\hline
\%s & subject \\
\hline
\end{tabular}
\end{center}

The author is the person who originally wrote the work, whereas the commiter is the person who last applied the work.\\
