latexbooks/pro-git/pro-git.org
*** options to limit the output of git log

+-------------------+-----------------------------------------------------------------+
|-(n)               |shwo only the last n commits                                     |
+-------------------+-----------------------------------------------------------------+
|--since, --after   |limite the commits to those made after the specified date        |
+-------------------+-----------------------------------------------------------------+
|--until, --before  |limit the commits to those made before the specified date        |
+-------------------+-----------------------------------------------------------------+
|--author           |only show commits in which the author entry matches the specified|
|                   |string                                                           |
+-------------------+-----------------------------------------------------------------+
|--commiter         |only show commits in which the committer entry matches the       |
|                   |specified string                                                 |
+-------------------+-----------------------------------------------------------------+
|--grep             |only show commits with a commit message containing the string    |
+-------------------+-----------------------------------------------------------------+
|-S                 |only show commits adding or removing code matching the string    |
+-------------------+-----------------------------------------------------------------+
#+BEGIN_SRC sh
git log --sine=2.weeks
#+END_SRC

note that: if you want to specify both author and grep options, you have to add --all-match or the command will match commits with either.
#+BEGIN_SRC sh
git log -Sfunction_name
#+END_SRC

If you specify a directory or file name, you can limit the log output to commits that introduced a change to those files. 
This is always the last option and is generally preceded by double dashes(--) to seperate the paths from the options.

to see which commits modifying test files in the Git source code hisotry are merged and were committed by Junio Hamano in the month of October 2008:
#+BEGIN_SRC sh
git log --pretty="%h - %s" --author="Junio Hamano" --since="2008-10-01" --before="2008-10-01" --no-merges -- test
#+END_SRC


** Undoing Things
One of the common undos takes place when you commit too early and possibly forget to add some files, or you mess up your commit message. If you want to try that commit again, you can run commit with the --amend option:
#+BEGIN_SRC sh
git commit --amend
#+END_SRC


you end up with a single commit -- the second commit replaces the result of the first.

*** Unstaging a Staged File
to unstage: 
#+BEGIN_EXAMPLE
git reset HEAD <file>
git reset -h
git reset --help  # verbose help information
#+END_EXAMPLE


*** Unmodifying a Modified File
to discard changes in working directory: 
#+BEGIN_SRC sh
git checkout -- <file>
git checkout -h
#+END_SRC

It's important to understand that git checkout -- <file> is a dangerous command. Any changes you made to that file are gone.


** Working with Remotes
*** Showing Your Remotes
#+BEGIN_SRC sh
git remote
git remote -v
git remote -h
#+END_SRC


*** Fetching and Pulling from Your Remotes
#+BEGIN_SRC sh
git fetch [remote-name]
git fetch -h
#+END_SRC

If you clone a repository, the command automatically adds that remote repository under the name "origin".

The git fetch command only downloads the data to your local repository - it doesn't automatically merge it with any of your work or modify what you're currently working on.

#+BEGIN_EXAMPLE
git pull [remote-name]
git pull -h
#+END_EXAMPLE
If your current branch is set up to track a remote branch, you can use the git pull command to automatically fetch and then merge that remote branch into your current branch.

