latexbooks/pro-git/pro-git.html


<div id="outline-container-sec-2-3-3" class="outline-4">
<h4 id="sec-2-3-3"><span class="section-number-4">2.3.3</span> options to limit the output of git log</h4>
<div class="outline-text-4" id="text-2-3-3">
<!-- This HTML table template is generated by emacs 25.2.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      -(n)&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      shwo&nbsp;only&nbsp;the&nbsp;last&nbsp;n&nbsp;commits&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      --since,&nbsp;--after&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      limite&nbsp;the&nbsp;commits&nbsp;to&nbsp;those&nbsp;made&nbsp;after&nbsp;the&nbsp;specified&nbsp;date&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      --until,&nbsp;--before&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      limit&nbsp;the&nbsp;commits&nbsp;to&nbsp;those&nbsp;made&nbsp;before&nbsp;the&nbsp;specified&nbsp;date&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      --author&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      only&nbsp;show&nbsp;commits&nbsp;in&nbsp;which&nbsp;the&nbsp;author&nbsp;entry&nbsp;matches&nbsp;the&nbsp;specified<br />
      string&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      --commiter&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      only&nbsp;show&nbsp;commits&nbsp;in&nbsp;which&nbsp;the&nbsp;committer&nbsp;entry&nbsp;matches&nbsp;the&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      specified&nbsp;string&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      --grep&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      only&nbsp;show&nbsp;commits&nbsp;with&nbsp;a&nbsp;commit&nbsp;message&nbsp;containing&nbsp;the&nbsp;string&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      -S&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      only&nbsp;show&nbsp;commits&nbsp;adding&nbsp;or&nbsp;removing&nbsp;code&nbsp;matching&nbsp;the&nbsp;string&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
</table>
<div class="org-src-container">

<pre class="src src-sh">git log --sine=2.weeks
</pre>
</div>

<p>
note that: if you want to specify both author and grep options, you have to add &#x2013;all-match or the command will match commits with either.<br  />
</p>
<div class="org-src-container">

<pre class="src src-sh">git log -Sfunction_name
</pre>
</div>

<p>
If you specify a directory or file name, you can limit the log output to commits that introduced a change to those files.<br  />
This is always the last option and is generally preceded by double dashes(&#x2013;) to seperate the paths from the options.<br  />
</p>

<p>
to see which commits modifying test files in the Git source code hisotry are merged and were committed by Junio Hamano in the month of October 2008:<br  />
</p>
<div class="org-src-container">

<pre class="src src-sh">git log --pretty="%h - %s" --author="Junio Hamano" --since="2008-10-01" --before="2008-10-01" --no-merges -- test
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Undoing Things</h3>
<div class="outline-text-3" id="text-2-4">
<p>
One of the common undos takes place when you commit too early and possibly forget to add some files, or you mess up your commit message. If you want to try that commit again, you can run commit with the &#x2013;amend option:<br  />
</p>
<div class="org-src-container">

<pre class="src src-sh">git commit --amend
</pre>
</div>


<p>
you end up with a single commit &#x2013; the second commit replaces the result of the first.<br  />
</p>
</div>

<div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> Unstaging a Staged File</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
to unstage:<br  />
</p>
<pre class="example">
git reset HEAD &lt;file&gt;
git reset -h
git reset --help  # verbose help information
</pre>
</div>
</div>


<div id="outline-container-sec-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> Unmodifying a Modified File</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
to discard changes in working directory:<br  />
</p>
<div class="org-src-container">

<pre class="src src-sh">git checkout -- &lt;file&gt;
git checkout -h
</pre>
</div>

<p>
It's important to understand that git checkout &#x2013; &lt;file&gt; is a dangerous command. Any changes you made to that file are gone.<br  />
</p>
</div>
</div>
</div>


<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Working with Remotes</h3>
<div class="outline-text-3" id="text-2-5">
</div><div id="outline-container-sec-2-5-1" class="outline-4">
<h4 id="sec-2-5-1"><span class="section-number-4">2.5.1</span> Showing Your Remotes</h4>
<div class="outline-text-4" id="text-2-5-1">
<div class="org-src-container">

<pre class="src src-sh">git remote
git remote -v
git remote -h
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-5-2" class="outline-4">
<h4 id="sec-2-5-2"><span class="section-number-4">2.5.2</span> Fetching and Pulling from Your Remotes</h4>
<div class="outline-text-4" id="text-2-5-2">
<div class="org-src-container">

<pre class="src src-sh">git fetch [remote-name]
git fetch -h
</pre>
</div>

<p>
If you clone a repository, the command automatically adds that remote repository under the name "origin".<br  />
</p>

<p>
The git fetch command only downloads the data to your local repository - it doesn't automatically merge it with any of your work or modify what you're currently working on.<br  />
</p>

<pre class="example">
git pull [remote-name]
git pull -h
</pre>
<p>
If your current branch is set up to track a remote branch, you can use the git pull command to automatically fetch and then merge that remote branch into your current branch.<br  />
</p>
</div>
</div>
