latexbooks/pro-git/pro-git.tex


\subsubsection{options to limit the output of git log}
\label{sec:org1f7b88b}

\begin{center}
\begin{tabular}{|l|l|}
\hline
-(n) & shwo only the last n commits \\
\hline
--since, --after & limite the commits to those made after the specified date \\
\hline
--until, --before & limit the commits to those made before the specified date \\
\hline
--author & only show commits in which the author entry matches the specified \\
 & string \\
\hline
--commiter & only show commits in which the committer entry matches the \\
 & specified string \\
\hline
--grep & only show commits with a commit message containing the string \\
\hline
-S & only show commits adding or removing code matching the string \\
\hline
\end{tabular}
\end{center}
\begin{verbatim}
git log --sine=2.weeks
\end{verbatim}

note that: if you want to specify both author and grep options, you have to add --all-match or the command will match commits with either.\\
\begin{verbatim}
git log -Sfunction_name
\end{verbatim}

If you specify a directory or file name, you can limit the log output to commits that introduced a change to those files.\\
This is always the last option and is generally preceded by double dashes(--) to seperate the paths from the options.\\

to see which commits modifying test files in the Git source code hisotry are merged and were committed by Junio Hamano in the month of October 2008:\\
\begin{verbatim}
git log --pretty="%h - %s" --author="Junio Hamano" --since="2008-10-01" --before="2008-10-01" --no-merges -- test
\end{verbatim}


\subsection{Undoing Things}
\label{sec:org439448e}
One of the common undos takes place when you commit too early and possibly forget to add some files, or you mess up your commit message. If you want to try that commit again, you can run commit with the --amend option:\\
\begin{verbatim}
git commit --amend
\end{verbatim}


you end up with a single commit -- the second commit replaces the result of the first.\\

\subsubsection{Unstaging a Staged File}
\label{sec:org649e381}
to unstage:\\
\begin{verbatim}
git reset HEAD <file>
git reset -h
git reset --help  # verbose help information
\end{verbatim}


\subsubsection{Unmodifying a Modified File}
\label{sec:org5b5711d}
to discard changes in working directory:\\
\begin{verbatim}
git checkout -- <file>
git checkout -h
\end{verbatim}

It's important to understand that git checkout -- <file> is a dangerous command. Any changes you made to that file are gone.\\


\subsection{Working with Remotes}
\label{sec:orgc76c204}
\subsubsection{Showing Your Remotes}
\label{sec:orga2b2134}
\begin{verbatim}
git remote
git remote -v
git remote -h
\end{verbatim}


\subsubsection{Fetching and Pulling from Your Remotes}
\label{sec:org99f9a9e}
\begin{verbatim}
git fetch [remote-name]
git fetch -h
\end{verbatim}

If you clone a repository, the command automatically adds that remote repository under the name "origin".\\

The git fetch command only downloads the data to your local repository - it doesn't automatically merge it with any of your work or modify what you're currently working on.\\

\begin{verbatim}
git pull [remote-name]
git pull -h
\end{verbatim}
If your current branch is set up to track a remote branch, you can use the git pull command to automatically fetch and then merge that remote branch into your current branch.\\
