latexbooks/pro-git/pro-git.org
*** Pushing to Your Remotes
#+BEGIN_EXAMPLE
git push [remote-name] [branch name]
git push -h
#+END_EXAMPLE
If you and someone else clone at the same time and they push upstream and then you push upstream, your push will rightly be rejected. You'll have to fetch their work first and incorporate it into yours before you'll be allowed to push.

*** Inspecting a Rmote
#+BEGIN_EXAMPLE
git remote show [remote-name]
#+END_EXAMPLE

*** Removing and Renaming Remotes
#+BEGIN_EXAMPLE
git remote rename [remote_name_from] [remote_name_to]
git remote rm [remote_name]
#+END_EXAMPLE



** Tagging
Git has the ability to tag specific points in history as being important.

*** Listing Your Tags
#+BEGIN_EXAMPLE
git tag
git tag -l <pattern>
git tag --list <pattern>

git tag -l "v1.8.5*"

git tag -h
#+END_EXAMPLE

*** Creating Tags
Git uses two main types of tags: lightweight and annotated.
A lightweight tag is very much like a branch that doesn't change - it's just a pointer to a specific commit.
Annotated tags are stored as full objects in the Git database. They are checksummed; contain the tagger name, email, and date; have a tagging message; and can be signed and verified with GNU Privacy Guard (GPG).

**** Annatated Tags
#+BEGIN_EXAMPLE
git tag -a v1.4 -m "my version 1.4"
# a: annotated
# m: message
# s: sign

git show v1.0
#+END_EXAMPLE


**** Lightweight Tags
to create a lightweight tag, don't supply tha -a, -s, or -m option:
#+BEGIN_EXAMPLE
git tag v1.0-lw
#+END_EXAMPLE


*** Tagging Later
to see the checksums:
#+BEGIN_EXAMPLE
git log --pretty=oneline
#+END_EXAMPLE


to tag that commit, you specify the commit checksum (or part of it):
#+BEGIN_EXAMPLE
git tag -a v1.1 <checksum>
#+END_EXAMPLE



*** Sharing Tags
By default, the git push command doesn't transfer tags to remote servers.

#+BEGIN_SRC sh
git push origin [tagname]
git push origin --tags  # transfer all of your tags to the remote server that are not already there.
#+END_SRC



** Git Aliases
Git doesn't automatically infer your command if you type it in partially. If you don't want to type the entire text of the Git commands, you can easily set up an alias for each command using git config.
#+BEGIN_SRC sh
git config --global alias.co checkout
git config --global alias.br branch
git config --global alias.ci commit
git config --global alias.st status
git config --global alias.last 'log -1 HEAD'
#+END_SRC

This technique can also be very useful in creating commands that you think should exist.
#+BEGIN_SRC sh
git config --global alias.unstage 'reset HEAD --'
#+END_SRC

This makes the following two commands equivalent:
#+BEGIN_SRC sh
git unstage fileA
git reset HEAD -- fileA
#+END_SRC


* Git Branching
Branching means you diverge from the main line of development and continue to do work without messing with that main line.

** Branching in a Nutshell
A branch in Git is simply a lightweight movable pointer to one of the commits.

The "master" branch in Git is not special branch. It is exactly like any other branch. The only reason nearly every repository has one is that the git init command creates it by dafault and most people don't bother to change it.

*** Creating a New Branch
git branch <branch_name>

What happens if you create a new branch?
Doing so creates a new pointer for you to move around.

How dose Git know what branch you're currently on?
It keeps a special pointer called HEAD.

The git branch command only created a new branch - it didn't switch to that branch.

to show where the branching pointers are pointing:
git log --oneline --decorate

*** Switching Branches
git checkout <branch_name>

If your working directory or staging area has uncommitted changes that conflict with the branch you're checking out, Git won't let you switch branches.


git log --oneline --decorate --graph --all


** Basic Branching and Merging
