latexbooks/pro-git/pro-git.html

<div id="outline-container-sec-2-5-3" class="outline-4">
<h4 id="sec-2-5-3"><span class="section-number-4">2.5.3</span> Pushing to Your Remotes</h4>
<div class="outline-text-4" id="text-2-5-3">
<pre class="example">
git push [remote-name] [branch name]
git push -h
</pre>
<p>
If you and someone else clone at the same time and they push upstream and then you push upstream, your push will rightly be rejected. You'll have to fetch their work first and incorporate it into yours before you'll be allowed to push.<br  />
</p>
</div>
</div>

<div id="outline-container-sec-2-5-4" class="outline-4">
<h4 id="sec-2-5-4"><span class="section-number-4">2.5.4</span> Inspecting a Rmote</h4>
<div class="outline-text-4" id="text-2-5-4">
<pre class="example">
git remote show [remote-name]
</pre>
</div>
</div>

<div id="outline-container-sec-2-5-5" class="outline-4">
<h4 id="sec-2-5-5"><span class="section-number-4">2.5.5</span> Removing and Renaming Remotes</h4>
<div class="outline-text-4" id="text-2-5-5">
<pre class="example">
git remote rename [remote_name_from] [remote_name_to]
git remote rm [remote_name]
</pre>
</div>
</div>
</div>



<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Tagging</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Git has the ability to tag specific points in history as being important.<br  />
</p>
</div>

<div id="outline-container-sec-2-6-1" class="outline-4">
<h4 id="sec-2-6-1"><span class="section-number-4">2.6.1</span> Listing Your Tags</h4>
<div class="outline-text-4" id="text-2-6-1">
<pre class="example">
git tag
git tag -l &lt;pattern&gt;
git tag --list &lt;pattern&gt;

git tag -l "v1.8.5*"

git tag -h
</pre>
</div>
</div>

<div id="outline-container-sec-2-6-2" class="outline-4">
<h4 id="sec-2-6-2"><span class="section-number-4">2.6.2</span> Creating Tags</h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
Git uses two main types of tags: lightweight and annotated.<br  />
A lightweight tag is very much like a branch that doesn't change - it's just a pointer to a specific commit.<br  />
Annotated tags are stored as full objects in the Git database. They are checksummed; contain the tagger name, email, and date; have a tagging message; and can be signed and verified with GNU Privacy Guard (GPG).<br  />
</p>
</div>

<ol class="org-ol"><li><a id="sec-2-6-2-1" name="sec-2-6-2-1"></a>Annatated Tags<br  /><div class="outline-text-5" id="text-2-6-2-1">
<pre class="example">
git tag -a v1.4 -m "my version 1.4"
# a: annotated
# m: message
# s: sign

git show v1.0
</pre>
</div>
</li>


<li><a id="sec-2-6-2-2" name="sec-2-6-2-2"></a>Lightweight Tags<br  /><div class="outline-text-5" id="text-2-6-2-2">
<p>
to create a lightweight tag, don't supply tha -a, -s, or -m option:<br  />
</p>
<pre class="example">
git tag v1.0-lw
</pre>
</div>
</li></ol>
</div>


<div id="outline-container-sec-2-6-3" class="outline-4">
<h4 id="sec-2-6-3"><span class="section-number-4">2.6.3</span> Tagging Later</h4>
<div class="outline-text-4" id="text-2-6-3">
<p>
to see the checksums:<br  />
</p>
<pre class="example">
git log --pretty=oneline
</pre>


<p>
to tag that commit, you specify the commit checksum (or part of it):<br  />
</p>
<pre class="example">
git tag -a v1.1 &lt;checksum&gt;
</pre>
</div>
</div>



<div id="outline-container-sec-2-6-4" class="outline-4">
<h4 id="sec-2-6-4"><span class="section-number-4">2.6.4</span> Sharing Tags</h4>
<div class="outline-text-4" id="text-2-6-4">
<p>
By default, the git push command doesn't transfer tags to remote servers.<br  />
</p>

<div class="org-src-container">

<pre class="src src-sh">git push origin [tagname]
git push origin --tags  # transfer all of your tags to the remote server that are not already there.
</pre>
</div>
</div>
</div>
</div>




<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> Git Aliases</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Git doesn't automatically infer your command if you type it in partially. If you don't want to type the entire text of the Git commands, you can easily set up an alias for each command using git config.<br  />
</p>
<div class="org-src-container">

<pre class="src src-sh">git config --global alias.co checkout
git config --global alias.br branch
git config --global alias.ci commit
git config --global alias.st status
git config --global alias.last 'log -1 HEAD'
</pre>
</div>

<p>
This technique can also be very useful in creating commands that you think should exist.<br  />
</p>
<div class="org-src-container">

<pre class="src src-sh">git config --global alias.unstage 'reset HEAD --'
</pre>
</div>

<p>
This makes the following two commands equivalent:<br  />
</p>
<div class="org-src-container">

<pre class="src src-sh">git unstage fileA
git reset HEAD -- fileA
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Git Branching</h2>
<div class="outline-text-2" id="text-3">
<p>
Branching means you diverge from the main line of development and continue to do work without messing with that main line.<br  />
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Branching in a Nutshell</h3>
<div class="outline-text-3" id="text-3-1">
<p>
A branch in Git is simply a lightweight movable pointer to one of the commits.<br  />
</p>

<p>
The "master" branch in Git is not special branch. It is exactly like any other branch. The only reason nearly every repository has one is that the git init command creates it by dafault and most people don't bother to change it.<br  />
</p>
</div>

<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Creating a New Branch</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
git branch &lt;branch_name&gt;<br  />
</p>

<p>
What happens if you create a new branch?<br  />
Doing so creates a new pointer for you to move around.<br  />
</p>

<p>
How dose Git know what branch you're currently on?<br  />
It keeps a special pointer called HEAD.<br  />
</p>

<p>
The git branch command only created a new branch - it didn't switch to that branch.<br  />
</p>

<p>
to show where the branching pointers are pointing:<br  />
git log &#x2013;oneline &#x2013;decorate<br  />
</p>
</div>
</div>

<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Switching Branches</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
git checkout &lt;branch_name&gt;<br  />
</p>

<p>
If your working directory or staging area has uncommitted changes that conflict with the branch you're checking out, Git won't let you switch branches.<br  />
</p>


<p>
git log &#x2013;oneline &#x2013;decorate &#x2013;graph &#x2013;all<br  />
</p>
</div>
</div>
</div>


<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Basic Branching and Merging</h3>
