latexbooks/pro-git/pro-git.tex

\subsubsection{Pushing to Your Remotes}
\label{sec:orgc917af4}
\begin{verbatim}
git push [remote-name] [branch name]
git push -h
\end{verbatim}
If you and someone else clone at the same time and they push upstream and then you push upstream, your push will rightly be rejected. You'll have to fetch their work first and incorporate it into yours before you'll be allowed to push.\\

\subsubsection{Inspecting a Rmote}
\label{sec:org7e8ee5a}
\begin{verbatim}
git remote show [remote-name]
\end{verbatim}

\subsubsection{Removing and Renaming Remotes}
\label{sec:org645007e}
\begin{verbatim}
git remote rename [remote_name_from] [remote_name_to]
git remote rm [remote_name]
\end{verbatim}



\subsection{Tagging}
\label{sec:org4d03e6e}
Git has the ability to tag specific points in history as being important.\\

\subsubsection{Listing Your Tags}
\label{sec:org34aaa02}
\begin{verbatim}
git tag
git tag -l <pattern>
git tag --list <pattern>

git tag -l "v1.8.5*"

git tag -h
\end{verbatim}

\subsubsection{Creating Tags}
\label{sec:org3ebba5c}
Git uses two main types of tags: lightweight and annotated.\\
A lightweight tag is very much like a branch that doesn't change - it's just a pointer to a specific commit.\\
Annotated tags are stored as full objects in the Git database. They are checksummed; contain the tagger name, email, and date; have a tagging message; and can be signed and verified with GNU Privacy Guard (GPG).\\

\begin{enumerate}
\item Annatated Tags
\label{sec:orgd0a14f9}
\begin{verbatim}
git tag -a v1.4 -m "my version 1.4"
# a: annotated
# m: message
# s: sign

git show v1.0
\end{verbatim}


\item Lightweight Tags
\label{sec:orge25a775}
to create a lightweight tag, don't supply tha -a, -s, or -m option:\\
\begin{verbatim}
git tag v1.0-lw
\end{verbatim}
\end{enumerate}


\subsubsection{Tagging Later}
\label{sec:orgdba76ad}
to see the checksums:\\
\begin{verbatim}
git log --pretty=oneline
\end{verbatim}


to tag that commit, you specify the commit checksum (or part of it):\\
\begin{verbatim}
git tag -a v1.1 <checksum>
\end{verbatim}



\subsubsection{Sharing Tags}
\label{sec:org45d9313}
By default, the git push command doesn't transfer tags to remote servers.\\

\begin{verbatim}
git push origin [tagname]
git push origin --tags  # transfer all of your tags to the remote server that are not already there.
\end{verbatim}



\subsection{Git Aliases}
\label{sec:orgd6df188}
Git doesn't automatically infer your command if you type it in partially. If you don't want to type the entire text of the Git commands, you can easily set up an alias for each command using git config.\\
\begin{verbatim}
git config --global alias.co checkout
git config --global alias.br branch
git config --global alias.ci commit
git config --global alias.st status
git config --global alias.last 'log -1 HEAD'
\end{verbatim}

This technique can also be very useful in creating commands that you think should exist.\\
\begin{verbatim}
git config --global alias.unstage 'reset HEAD --'
\end{verbatim}

This makes the following two commands equivalent:\\
\begin{verbatim}
git unstage fileA
git reset HEAD -- fileA
\end{verbatim}


\section{Git Branching}
\label{sec:org4475f22}
Branching means you diverge from the main line of development and continue to do work without messing with that main line.\\

\subsection{Branching in a Nutshell}
\label{sec:orgcfb6bea}
A branch in Git is simply a lightweight movable pointer to one of the commits.\\

The "master" branch in Git is not special branch. It is exactly like any other branch. The only reason nearly every repository has one is that the git init command creates it by dafault and most people don't bother to change it.\\

\subsubsection{Creating a New Branch}
\label{sec:org1ef233d}
git branch <branch\_name>\\

What happens if you create a new branch?\\
Doing so creates a new pointer for you to move around.\\

How dose Git know what branch you're currently on?\\
It keeps a special pointer called HEAD.\\

The git branch command only created a new branch - it didn't switch to that branch.\\

to show where the branching pointers are pointing:\\
git log --oneline --decorate\\

\subsubsection{Switching Branches}
\label{sec:org3c4cc21}
git checkout <branch\_name>\\

If your working directory or staging area has uncommitted changes that conflict with the branch you're checking out, Git won't let you switch branches.\\


git log --oneline --decorate --graph --all\\


\subsection{Basic Branching and Merging}
\label{sec:org5a470e6}
