latexbooks/pro-git/pro-git.html
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Basic Branching</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
to create a branch and switch to it at the same time:<br  />
git checkout -b &lt;branch_name&gt;<br  />
</p>

<p>
to merge hotfix into master:<br  />
git checkout master<br  />
git merge hotfix<br  />
</p>

<p>
to delete a branch:<br  />
git branch -d &lt;branch_name&gt;<br  />
</p>



<p>
master        hotfix<br  />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
C2      &lt;&#x2013;&#x2014;&#x2014;&#x2014;       C4<br  />
</p>

<p>
Because the commit C4 pointed to by the branch hotfix you merged in was directly ahead of the commit C2 you're on, Git simply moves the pointer forward.<br  />
To phrase that another way, when you try merge one commit with a commit that can be reached by following the first commit's history, Git simplifies things by moving the pointer forward because there is no divergent work together &#x2013; this is called a "fast-forward".<br  />
</p>
</div>
</div>

<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> Basic Merging</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
git checkout master<br  />
git merge iss53<br  />
</p>


<p>
common            master<br  />
ancestor                                          master(result)<br  />
                      snapshot to merge into<br  />
 C2  &lt;-&#x2014;&#x2014;        C4   &#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014; C6<br  />
                \                                /<br  />
           \                           /<br  />
            \                          /<br  />
             \                       /<br  />
                 \                       /<br  />
                 \                          /<br  />
                  \                      /<br  />
                     C3 &#x2013;&#x2014;&#x2014;&#x2014;  C5<br  />
                               snapshot to merge into<br  />
</p>

<p>
iss53<br  />
</p>

<p>
Because the commit on the branch you're on isn't a direct ancestor of the branch you're mergingin, Git has to do some work.<br  />
In this case, Git does a simple three-way merge, using the two snapshots pointed to by the branch tips and the common ancestor of the two.<br  />
Instead of moving the branch pointer forward, Git creates a new snapshot that results from this three-way merge and automatically creates a new commit that points to it.<br  />
</p>
</div>
</div>
