latexbooks/pro-git/pro-git.tex
\subsubsection{Basic Branching}
\label{sec:org24db867}

to create a branch and switch to it at the same time:\\
git checkout -b <branch\_name>\\

to merge hotfix into master:\\
git checkout master\\
git merge hotfix\\

to delete a branch:\\
git branch -d <branch\_name>\\



master		hotfix\\
\begin{center}
\begin{tabular}{l}
\\
\\
\\
\end{tabular}
\end{center}
C2	  <----------- 	  C4\\

Because the commit C4 pointed to by the branch hotfix you merged in was directly ahead of the commit C2 you're on, Git simply moves the pointer forward.\\
To phrase that another way, when you try merge one commit with a commit that can be reached by following the first commit's history, Git simplifies things by moving the pointer forward because there is no divergent work together -- this is called a "fast-forward".\\

\subsubsection{Basic Merging}
\label{sec:orgb330fea}

git checkout master\\
git merge iss53\\


common            master\\
ancestor     	      			      		 master(result)\\
                                  snapshot to merge into\\
 C2  <-------    	C4   ------------------------------ C6\\
                            $\backslash$ 	   	       	 	    /\\
                       $\backslash$	   	     		   /\\
                        $\backslash$	   	     		  /\\
                         $\backslash$       	   		 /\\
                                 $\backslash$  	  	       	/\\
                                 $\backslash$     	      	       /\\
                                  $\backslash$    	              /\\
                                     C3 -----------  C5\\
                                                       snapshot to merge into\\

iss53\\

Because the commit on the branch you're on isn't a direct ancestor of the branch you're mergingin, Git has to do some work.\\
In this case, Git does a simple three-way merge, using the two snapshots pointed to by the branch tips and the common ancestor of the two.\\
Instead of moving the branch pointer forward, Git creates a new snapshot that results from this three-way merge and automatically creates a new commit that points to it.\\
