latexbooks/pro-git/pro-git.org
*** Basic Merge Conflicts

If you changed the same part of the same file differently in the two branches you are merging, Git won't be able to merge them cleanly.

to see the merge conflict:
git status

edit the unmerged files with emacs or vi and git add them.

to use a praphical tool to resolve these issues:
git mergetool

git config --global merge.tool emerge

+------+------------------------------------+
|C-]   |emerge-abort                        |
+------+------------------------------------+
|.     |emerge-find-difference              |
+------+------------------------------------+
|<     |emerge-scroll-left                  |
+------+------------------------------------+
|>     |emerge-scroll-right                 |
+------+------------------------------------+
|^     |emerge-scroll-down                  |
+------+------------------------------------+
|a     |emerge-select-A                     |
+------+------------------------------------+
|b     |emerge-select-B                     |
+------+------------------------------------+
|e     |emerge-edit-mode                    |
+------+------------------------------------+
|f     |emerge-fast-mode                    |
+------+------------------------------------+
|j     |emerge-jump-to-difference           |
+------+------------------------------------+
|l     |emerge-recenter                     |
+------+------------------------------------+
|m     |emerge-mark-difference              |
+------+------------------------------------+
|n     |emerge-next-difference              |
+------+------------------------------------+
|p     |emerge-previous-difference          |
+------+------------------------------------+
|q     |emerge-quit                         |
+------+------------------------------------+
|v     |emerge-scroll-up                    |
+------+------------------------------------+
||     |emerge-scroll-reset                 |
+------+------------------------------------+
|c a   |emerge-copy-as-kill-A               |
+------+------------------------------------+
|c b   |emerge-copy-as-kill-B               |
+------+------------------------------------+
|d a   |emerge-default-A                    |
+------+------------------------------------+
|d b   |emerge-default-B                    |
+------+------------------------------------+
|i a   |emerge-insert-A                     |
+------+------------------------------------+
|i b   |emerge-insert-B                     |
+------+------------------------------------+
|s a   |emerge-auto-advance                 |
+------+------------------------------------+
|s s   |emerge-skip-prefers                 |
+------+------------------------------------+
|x 1   |emerge-one-line-window              |
+------+------------------------------------+
|x C   |emerge-combine-versions-register    |
+------+------------------------------------+
|x c   |emerge-combine-versions             |
+------+------------------------------------+
|x f   |emerge-file-names                   |
+------+------------------------------------+
|x j   |emerge-join-differences             |
+------+------------------------------------+
|x l   |emerge-line-numbers                 |
+------+------------------------------------+
|x m   |emerge-set-merge-mode               |
+------+------------------------------------+
|x s   |emerge-split-difference             |
+------+------------------------------------+
|x t   |emerge-trim-difference              |
+------+------------------------------------+
|x x   |emerge-set-combine-versions-template|
+------+------------------------------------+


