latexbooks/pro-git/pro-git.tex

\subsubsection{Basic Merge Conflicts}
\label{sec:org479ef4b}

If you changed the same part of the same file differently in the two branches you are merging, Git won't be able to merge them cleanly.\\

to see the merge conflict:\\
git status\\

edit the unmerged files with emacs or vi and git add them.\\

to use a praphical tool to resolve these issues:\\
git mergetool\\

git config --global merge.tool emerge\\

\begin{center}
\begin{tabular}{|l|l|}
\hline
C-] & emerge-abort \\
\hline
. & emerge-find-difference \\
\hline
$<$ & emerge-scroll-left \\
\hline
$>$ & emerge-scroll-right \\
\hline
\^ & emerge-scroll-down \\
\hline
a & emerge-select-A \\
\hline
b & emerge-select-B \\
\hline
e & emerge-edit-mode \\
\hline
f & emerge-fast-mode \\
\hline
j & emerge-jump-to-difference \\
\hline
l & emerge-recenter \\
\hline
m & emerge-mark-difference \\
\hline
n & emerge-next-difference \\
\hline
p & emerge-previous-difference \\
\hline
q & emerge-quit \\
\hline
v & emerge-scroll-up \\
\hline
$|$ & emerge-scroll-reset \\
\hline
c a & emerge-copy-as-kill-A \\
\hline
c b & emerge-copy-as-kill-B \\
\hline
d a & emerge-default-A \\
\hline
d b & emerge-default-B \\
\hline
i a & emerge-insert-A \\
\hline
i b & emerge-insert-B \\
\hline
s a & emerge-auto-advance \\
\hline
s s & emerge-skip-prefers \\
\hline
x 1 & emerge-one-line-window \\
\hline
x C & emerge-combine-versions-register \\
\hline
x c & emerge-combine-versions \\
\hline
x f & emerge-file-names \\
\hline
x j & emerge-join-differences \\
\hline
x l & emerge-line-numbers \\
\hline
x m & emerge-set-merge-mode \\
\hline
x s & emerge-split-difference \\
\hline
x t & emerge-trim-difference \\
\hline
x x & emerge-set-combine-versions-template \\
\hline
\end{tabular}
\end{center}
