latexbooks/pro-git/pro-git.html


<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Branch Management</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The git branch command does more than just create and delete branches.<br  />
</p>

<p>
to get a simple listing of your current branches:<br  />
git branch<br  />
</p>


<p>
to see the last commit on each branch:<br  />
git branch -v<br  />
</p>

<p>
The usefull &#x2013;merged and &#x2013;no-merged can filter this lists to branches that you have or have not yet merged into the branch you're currently on:<br  />
git branch &#x2013;merged<br  />
</p>

<p>
Branches on the list without the * in front of them are generally fine to delete.<br  />
</p>

<p>
git branch &#x2013;unmerged (deprecated)<br  />
git branch &#x2013;no-merged (new)<br  />
</p>
</div>
</div>


<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Branching Workflows</h3>
<div class="outline-text-3" id="text-3-4">
</div><div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> Long-Running Branches</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
Many Git developers have a workflow that having only code that is entirely stable in their master branch. They have another parallel branch named develop that they work from or use to test stability.<br  />
</p>

<p>
It's generally easier to think about them as work silos, where sets of commits graduate to a more stable silo when they're fully tested.<br  />
</p>



<p>
&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;     master<br  />
     \<br  />
      \<br  />
       \<br  />
        \<br  />
         &#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;    develop<br  />
          \<br  />
           \<br  />
                      \<br  />
         \<br  />
          &#x2013;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;  topic<br  />
</p>


<p>
The idea is that your branches are at various levels of stability; when they reach a more stable level, they're merged into the branch above them.<br  />
</p>
</div>
</div>


<div id="outline-container-sec-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> Topic Branches</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
A topic branch is a short-lived branch that you create and use for a single particular feature or related work.<br  />
</p>

<p>
It's important to remember when you're doing all this that these branches are completely local.<br  />
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Remote Branches</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Remote references are references (pointers) in your remote repositories, including branches, tags, and so on.<br  />
</p>

<p>
To get a full list of remote references:<br  />
git ls-remote [remote]<br  />
git remote show [remote]<br  />
</p>

<p>
a more common way is to take advantage of remote-tracking branches:<br  />
Remote-tracking branches are references to the state of remote branches.<br  />
They are local references that you can not move; they are moved automatically for you whenever you do any network communication.<br  />
Remote-tracking branches act as bookmark to remind you where the branches in your remote repositories were the last time you connected to them.<br  />
</p>

<p>
form:<br  />
(remote)/(branch)<br  />
</p>

<p>
note:<br  />
Just like the branch name "master" does not have any special meaning in Git, neither does "origin".<br  />
"origin" is the default name for a remote when you run git clone.<br  />
</p>
</div>


<div id="outline-container-sec-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> Pushing</h4>
<div class="outline-text-4" id="text-3-5-1">
<p>
git push &lt;remote&gt; &lt;remote_branch&gt;<br  />
git push &lt;remote&gt; &lt;local_branch&gt;:&lt;remote_branch&gt;<br  />
</p>

<p>
git push origin serverfix<br  />
This is a shortcut. Git automatically expands the serverfix branchname out to<br  />
serverfix:serverfix<br  />
</p>

<p>
git push origin serverfix:serverfix<br  />
Take my serverfix and make it the remote's serverfix<br  />
</p>

<p>
When you do a fetch that brings down new remote-tracking branches, you don't automatically have local, editable copies of them.<br  />
</p>

<p>
git fetch origin (new branch serverfix is pulled suppose)<br  />
To merge this work into your current working branch, you can run<br  />
git merge origin/serverfix<br  />
</p>

<p>
If you want your own serverfix branch that you can work on, you can base it off your remote-tracking branch:<br  />
git checkout -b serverfix origin/serverfix<br  />
b: branch<br  />
</p>
</div>
</div>

<div id="outline-container-sec-3-5-2" class="outline-4">
<h4 id="sec-3-5-2"><span class="section-number-4">3.5.2</span> Tracking Branches</h4>
<div class="outline-text-4" id="text-3-5-2">
<p>
Checking out a local branch from a remote-tracking branch automatically creates what is called a "tracking branch" (and the branch it tracks is called an "upstream branch"). Tracking branches are local branches tha have a direct relationship to a remote branch.<br  />
</p>

<p>
If you are on a tracking branch and type git pull, Git automatically knows which server to fetch from and branch to merge into.<br  />
</p>

<p>
You can set up other tracking branches if you wish:<br  />
git checkout -b [branch] [remotename]/[remote_branch]<br  />
shorthand:<br  />
git checkout &#x2013;track origin/serverfix<br  />
</p>

<p>
To have different name with origin:<br  />
git checkout -b &lt;different_branchname&gt; &lt;origin&gt;/&lt;branch&gt;<br  />
</p>


<p>
If you already have a local branch and want to set it to a remote branch:<br  />
git branch -u &lt;remote&gt;/&lt;branch&gt;<br  />
or<br  />
git branch &#x2013;set-upstream-to &lt;remote&gt;/&lt;branch&gt;<br  />
</p>

<p>
To see what tracking branches you have set up:<br  />
git branch -vv<br  />
It is important to note that these numbers are only since the last time you fetch from each server. This command does not reach out to the server.<br  />
</p>
</div>
</div>
