latexbooks/pro-git/pro-git.tex


\subsection{Branch Management}
\label{sec:orge9a8306}
The git branch command does more than just create and delete branches.\\

to get a simple listing of your current branches:\\
git branch\\


to see the last commit on each branch:\\
git branch -v\\

The usefull --merged and --no-merged can filter this lists to branches that you have or have not yet merged into the branch you're currently on:\\
git branch --merged\\

Branches on the list without the * in front of them are generally fine to delete.\\

git branch --unmerged (deprecated)\\
git branch --no-merged (new)\\


\subsection{Branching Workflows}
\label{sec:org0d16962}

\subsubsection{Long-Running Branches}
\label{sec:org48514bf}
Many Git developers have a workflow that having only code that is entirely stable in their master branch. They have another parallel branch named develop that they work from or use to test stability.\\

It's generally easier to think about them as work silos, where sets of commits graduate to a more stable silo when they're fully tested.\\



------------------------------------------------------------------------     master\\
	 $\backslash$\\
	  $\backslash$\\
	   $\backslash$\\
	    $\backslash$\\
	     ------------------------------------------------------------    develop\\
	      $\backslash$\\
	       $\backslash$\\
       	       	$\backslash$\\
		 $\backslash$\\
		  -----------------------------------------------------------  topic\\


The idea is that your branches are at various levels of stability; when they reach a more stable level, they're merged into the branch above them.\\


\subsubsection{Topic Branches}
\label{sec:org3c0dddd}
A topic branch is a short-lived branch that you create and use for a single particular feature or related work.\\

It's important to remember when you're doing all this that these branches are completely local.\\

\subsection{Remote Branches}
\label{sec:org7ce8ed3}
Remote references are references (pointers) in your remote repositories, including branches, tags, and so on.\\

To get a full list of remote references:\\
git ls-remote [remote]\\
git remote show [remote]\\

a more common way is to take advantage of remote-tracking branches:\\
Remote-tracking branches are references to the state of remote branches.\\
They are local references that you can not move; they are moved automatically for you whenever you do any network communication.\\
Remote-tracking branches act as bookmark to remind you where the branches in your remote repositories were the last time you connected to them.\\

form:\\
(remote)/(branch)\\

note:\\
Just like the branch name "master" does not have any special meaning in Git, neither does "origin".\\
"origin" is the default name for a remote when you run git clone.\\


\subsubsection{Pushing}
\label{sec:org256bd4f}
git push <remote> <remote\_branch>\\
git push <remote> <local\_branch>:<remote\_branch>\\

git push origin serverfix\\
This is a shortcut. Git automatically expands the serverfix branchname out to\\
serverfix:serverfix\\

git push origin serverfix:serverfix\\
Take my serverfix and make it the remote's serverfix\\

When you do a fetch that brings down new remote-tracking branches, you don't automatically have local, editable copies of them.\\

git fetch origin (new branch serverfix is pulled suppose)\\
To merge this work into your current working branch, you can run\\
git merge origin/serverfix\\

If you want your own serverfix branch that you can work on, you can base it off your remote-tracking branch:\\
git checkout -b serverfix origin/serverfix\\
b: branch\\

\subsubsection{Tracking Branches}
\label{sec:orgcc90530}
Checking out a local branch from a remote-tracking branch automatically creates what is called a "tracking branch" (and the branch it tracks is called an "upstream branch"). Tracking branches are local branches tha have a direct relationship to a remote branch.\\

If you are on a tracking branch and type git pull, Git automatically knows which server to fetch from and branch to merge into.\\

You can set up other tracking branches if you wish:\\
git checkout -b [branch] [remotename]/[remote\_branch]\\
shorthand:\\
git checkout --track origin/serverfix\\

To have different name with origin:\\
git checkout -b <different\_branchname> <origin>/<branch>\\


If you already have a local branch and want to set it to a remote branch:\\
git branch -u <remote>/<branch>\\
or\\
git branch --set-upstream-to <remote>/<branch>\\

To see what tracking branches you have set up:\\
git branch -vv\\
It is important to note that these numbers are only since the last time you fetch from each server. This command does not reach out to the server.\\
