latexbooks/pro-git/pro-git.org
*** Pulling
git pull

This will look up what server and branch your current is tracking, fetching from that server and then try to merge in that remote branch.

*** Deleting Remote Branches
git push <remote> --delete <remote_branch>

Basically all this does is remove the pointer from the server. The Git server will generally keep the data there for a while until a garbage collection runs.






** Rebasing
In Git, there are two main ways to integrate chages from one branch into another:
the merge and the rebase

*** The Basic Rebase
				
			      C4
			   /   	
			  /   experiment
			 /		
		       	/		
		       /		
		      /			
		     /			
		    /			
       	       	   /			
 C1 <------------ C2 <----------------C3
					
				     master


you can take the patch of the change that was introduced in C4 and reapply it on top of C3. In Git this is called rebasing.
With the rebase command, you can take all the changes that were committed on one branch and replay them on another one.

git checkout experiment
git rebase master

It works by going to the common ancestor of the two branches, getting the diff introduced by each commit of the branch you're on, saving those diffs to temporary files, resetting the current branch to the same commit as the branch you are rebasing onto, and finally applying each change in turn.



 C1 <------------- C2 <----------------- C3 <---------------- C4'
    		      			 master		      experiment

At this point, you can go back to the master branch and do a fast-forward merge
git checkout master
git merge experiment


There is no difference in the end product of the integration (comparing to merge), but rebasing makes for a cleaner history.

Rebasing replays changes from one line of work onto another inthe order they are introduced, whereas merging takes the endpoints and merges them together.

*** More Interesting Rebases
You can have your rebase replay on something other than the rebase target branch.
						       
				       master         	       
  C1 <------- C2 <------- C5 <--------- C6   	       
		\			     	       
		 \			     	       
		  \			     	       
		   \			     	       
		    \			     	       
		     \			     	       
		      \			       	   server
		       	 C3 <---------  C4 <------- C10	 
			  \				 
			   \				 
			    \  	       	       	       	 
			     \
			      \
			       \
			       	\
				 \
				  \  C8 <---------- C9
				   		   client

You can take the changes on client that aren't on server (C8 and C9) and replay them on your master branch by:
git rebase --onto master server client.

This basically says, "checkout out the client branch, figure out the patches from the common ancestor of the client and server branches, and then replay them onto master.

				       	       	
				 master			client
 C1 <------ C2 <------ C5 <------ C6 <----- C8' <----- C9'    
	     \						      
       	      \						      
	       \					      
	       	\					      
		 \					      
       	       	  \   C3 <------- C4 <------ C10 	      
					    server

The Perils of Rebasing
Do not rebase commits that exist outside your repository.


*** Rebase vs. Merge
One point of view is that your repository's commit history is a record of what actually happened.
The opposing point of view is that the commit history is the story of how your project was made.

It's up to you to decide which one is best for your particular situation.

In general the way to get the best of both world is to rebase local changes you've made but haven't shared yet before you push them in order to clean up your story, but never rebase anything you've pushed somewhere.



* Git on the Server
Running a Git server is straightforward.
First, you choose which protocols you want your server to communicate with.
Second, setups using those protocols and get your server running with them.

A remote repository is generally a bare repository - a Git repository that has no working directory.
In the simplest terms, a bare repository is the contents of your project's .git directory and nothing else.

** The Protocols
