latexbooks/pro-git/pro-git.html

<div id="outline-container-sec-3-5-3" class="outline-4">
<h4 id="sec-3-5-3"><span class="section-number-4">3.5.3</span> Pulling</h4>
<div class="outline-text-4" id="text-3-5-3">
<p>
git pull<br  />
</p>

<p>
This will look up what server and branch your current is tracking, fetching from that server and then try to merge in that remote branch.<br  />
</p>
</div>
</div>

<div id="outline-container-sec-3-5-4" class="outline-4">
<h4 id="sec-3-5-4"><span class="section-number-4">3.5.4</span> Deleting Remote Branches</h4>
<div class="outline-text-4" id="text-3-5-4">
<p>
git push &lt;remote&gt; &#x2013;delete &lt;remote_branch&gt;<br  />
</p>

<p>
Basically all this does is remove the pointer from the server. The Git server will generally keep the data there for a while until a garbage collection runs.<br  />
</p>
</div>
</div>
</div>






<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Rebasing</h3>
<div class="outline-text-3" id="text-3-6">
<p>
In Git, there are two main ways to integrate chages from one branch into another:<br  />
the merge and the rebase<br  />
</p>
</div>

<div id="outline-container-sec-3-6-1" class="outline-4">
<h4 id="sec-3-6-1"><span class="section-number-4">3.6.1</span> The Basic Rebase</h4>
<div class="outline-text-4" id="text-3-6-1">
<p>
                 C4<br  />
              /<br  />
             /   experiment<br  />
            /<br  />
                  /<br  />
              /<br  />
             /<br  />
            /<br  />
           /<br  />
                        /<br  />
C1 &lt;&#x2014;&#x2014;&#x2014;&#x2014; C2 &lt;-&#x2014;&#x2014;&#x2014;&#x2014;&#x2014;C3<br  />
</p>

<p>
master<br  />
</p>


<p>
you can take the patch of the change that was introduced in C4 and reapply it on top of C3. In Git this is called rebasing.<br  />
With the rebase command, you can take all the changes that were committed on one branch and replay them on another one.<br  />
</p>

<p>
git checkout experiment<br  />
git rebase master<br  />
</p>

<p>
It works by going to the common ancestor of the two branches, getting the diff introduced by each commit of the branch you're on, saving those diffs to temporary files, resetting the current branch to the same commit as the branch you are rebasing onto, and finally applying each change in turn.<br  />
</p>



<p>
C1 &lt;-&#x2014;&#x2014;&#x2014;&#x2014; C2 &lt;&#x2013;&#x2014;&#x2014;&#x2014;&#x2014;&#x2014; C3 &lt;-&#x2014;&#x2014;&#x2014;&#x2014;&#x2014; C4'<br  />
                              master              experiment<br  />
</p>

<p>
At this point, you can go back to the master branch and do a fast-forward merge<br  />
git checkout master<br  />
git merge experiment<br  />
</p>


<p>
There is no difference in the end product of the integration (comparing to merge), but rebasing makes for a cleaner history.<br  />
</p>

<p>
Rebasing replays changes from one line of work onto another inthe order they are introduced, whereas merging takes the endpoints and merges them together.<br  />
</p>
</div>
</div>

<div id="outline-container-sec-3-6-2" class="outline-4">
<h4 id="sec-3-6-2"><span class="section-number-4">3.6.2</span> More Interesting Rebases</h4>
<div class="outline-text-4" id="text-3-6-2">
<p>
You can have your rebase replay on something other than the rebase target branch.<br  />
</p>

<p>
                     master<br  />
C1 &lt;-&#x2014;&#x2014; C2 &lt;-&#x2014;&#x2014; C5 &lt;&#x2014;&#x2014;&#x2014; C6<br  />
      \<br  />
       \<br  />
        \<br  />
         \<br  />
          \<br  />
           \<br  />
            \                          server<br  />
                  C3 &lt;&#x2014;&#x2014;&#x2014;  C4 &lt;-&#x2014;&#x2014; C10<br  />
            \<br  />
             \<br  />
              \<br  />
               \<br  />
                \<br  />
                 \<br  />
                     \<br  />
               \<br  />
                \  C8 &lt;-&#x2014;&#x2014;&#x2014; C9<br  />
                            client<br  />
</p>

<p>
You can take the changes on client that aren't on server (C8 and C9) and replay them on your master branch by:<br  />
git rebase &#x2013;onto master server client.<br  />
</p>

<p>
This basically says, "checkout out the client branch, figure out the patches from the common ancestor of the client and server branches, and then replay them onto master.<br  />
</p>


<p>
                master            client<br  />
C1 &lt;&#x2014;&#x2014; C2 &lt;&#x2014;&#x2014; C5 &lt;&#x2014;&#x2014; C6 &lt;&#x2013;&#x2014; C8' &lt;&#x2013;&#x2014; C9'<br  />
        \<br  />
                \<br  />
          \<br  />
              \<br  />
        \<br  />
                       \   C3 &lt;-&#x2014;&#x2014; C4 &lt;&#x2014;&#x2014; C10<br  />
                       server<br  />
</p>

<p>
The Perils of Rebasing<br  />
Do not rebase commits that exist outside your repository.<br  />
</p>
</div>
</div>


<div id="outline-container-sec-3-6-3" class="outline-4">
<h4 id="sec-3-6-3"><span class="section-number-4">3.6.3</span> Rebase vs. Merge</h4>
<div class="outline-text-4" id="text-3-6-3">
<p>
One point of view is that your repository's commit history is a record of what actually happened.<br  />
The opposing point of view is that the commit history is the story of how your project was made.<br  />
</p>

<p>
It's up to you to decide which one is best for your particular situation.<br  />
</p>

<p>
In general the way to get the best of both world is to rebase local changes you've made but haven't shared yet before you push them in order to clean up your story, but never rebase anything you've pushed somewhere.<br  />
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Git on the Server</h2>
<div class="outline-text-2" id="text-4">
<p>
Running a Git server is straightforward.<br  />
First, you choose which protocols you want your server to communicate with.<br  />
Second, setups using those protocols and get your server running with them.<br  />
</p>

<p>
A remote repository is generally a bare repository - a Git repository that has no working directory.<br  />
In the simplest terms, a bare repository is the contents of your project's .git directory and nothing else.<br  />
</p>
</div>
