latexbooks/pro-git/pro-git.org
*** Local Protocol
the most basic is the Local Protocol, in which the remote repository is in another directory on disk.
**** When to Use
If you have a shared mounted filesystem, then you can clone, push to, and pull from a local file-based repository.
**** form
git clone /opt/git/project.git
or
git clone file:///opt/git/project.git

If you just specify the path, Git tries to use hardlinks or directly copy the files it needs.
If youu specify file://, Git fires up the process that it normally uses to transfer data over a network which is generally a lot less efficient method of transferring the data. The main reason that specify the file:// prefix is if you want a clean copy of the repsitory with extraneous references or objects left out.

**** The Pros
simple and use existing file permissions and network access.

**** The Cons
shared access is generally more difficult to set up and reach from multiple locations than basic network access.
this protocol does not protect the repository against accidental damage.


*** The Http Protocols
**** smart http
The "smart" http protocol opertates very similarly to the ssh or git protocols but runs over standard http/s prots and can use various http authentication mechanisms.
read and write

**** dumb http
readonly

**** The Pros
The simplicity of having a single URL for all types of access and having the server prompt only when authentication is needed makes things very easy for the end user.

a very fast and efficient protocol similar to the ssh one.

**** The Cons
Git over HTTP/S can a little more tricky to set up compared to SSH on some servers.

*** The SSH Protocol
A common transport protocol for Git when self-hosting is over SSH.
**** form
git clone ssh://user@server/project.git
or
git clone user@server:project.git

**** The Pros
First, relatively easy to set up.
Second, access over SSH is secure.
Third, like the HTTP/S, Git and Local protocols, SSH is efficient, making the data as compact as possible before transferring it.

**** The Cons
you can't server anonymous access of your repository over it.

*** The Git Protocol
This is a special daemon that comes packaged with Git; it listens on a dedicated port(9418).
In order for a repository to be served over the Git protocol, you must create the git-daemon-export-ok file - the daemon won't serve a repository without that file in it - but other than that there is no security

**** The Pros
fatest network transfer protocol available.

**** The cons
the lack of authentication.

** Getting Git on a Server
*** First, get a bare repository
In order to initially set up any Git server, you have to export an existing repository into a new bare repository - a repository that doesn't contain a working directory.
git clone --bare my_project my_project.git
or
git init --bare

*** Second, copy it to a server
put the bare repository on a server and set up your protocols.

suppose, the server called git.example.com, store all your Git repository under the /srv/git directory:
scp -r my_project.git user@git.example.com:/srv/git

At this point, other users who have ssh access to the same server which has read-access to the /srv/git directory can clone your repository:
git clone user@git.example.com:/srv/git/my_project.git

If a user SSHs into a server and has write access to the /srv/git/my_project.git directory, they will alse automactically have push access.

Git will automatically add group write permissions to a repository properly:
cd /srv/git/my_project.git
git init --bare --shared

*** note
to collaborate with a couple of people on a private project, all you need it a SSH sever and a bare repository.


