latexbooks/pro-git/pro-git.html

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> The Protocols</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Local Protocol</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
the most basic is the Local Protocol, in which the remote repository is in another directory on disk.<br  />
</p>
</div>
<ol class="org-ol"><li><a id="sec-4-1-1-1" name="sec-4-1-1-1"></a>When to Use<br  /><div class="outline-text-5" id="text-4-1-1-1">
<p>
If you have a shared mounted filesystem, then you can clone, push to, and pull from a local file-based repository.<br  />
</p>
</div>
</li>
<li><a id="sec-4-1-1-2" name="sec-4-1-1-2"></a>form<br  /><div class="outline-text-5" id="text-4-1-1-2">
<p>
git clone /opt/git/project.git<br  />
or<br  />
git clone <a href="file:///opt/git/project.git">file:///opt/git/project.git</a><br  />
</p>

<p>
If you just specify the path, Git tries to use hardlinks or directly copy the files it needs.<br  />
If youu specify <a href="file://">file://</a>, Git fires up the process that it normally uses to transfer data over a network which is generally a lot less efficient method of transferring the data. The main reason that specify the <a href="file://">file://</a> prefix is if you want a clean copy of the repsitory with extraneous references or objects left out.<br  />
</p>
</div>
</li>

<li><a id="sec-4-1-1-3" name="sec-4-1-1-3"></a>The Pros<br  /><div class="outline-text-5" id="text-4-1-1-3">
<p>
simple and use existing file permissions and network access.<br  />
</p>
</div>
</li>

<li><a id="sec-4-1-1-4" name="sec-4-1-1-4"></a>The Cons<br  /><div class="outline-text-5" id="text-4-1-1-4">
<p>
shared access is generally more difficult to set up and reach from multiple locations than basic network access.<br  />
this protocol does not protect the repository against accidental damage.<br  />
</p>
</div>
</li></ol>
</div>


<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> The Http Protocols</h4>
<div class="outline-text-4" id="text-4-1-2">
</div><ol class="org-ol"><li><a id="sec-4-1-2-1" name="sec-4-1-2-1"></a>smart http<br  /><div class="outline-text-5" id="text-4-1-2-1">
<p>
The "smart" http protocol opertates very similarly to the ssh or git protocols but runs over standard http/s prots and can use various http authentication mechanisms.<br  />
read and write<br  />
</p>
</div>
</li>

<li><a id="sec-4-1-2-2" name="sec-4-1-2-2"></a>dumb http<br  /><div class="outline-text-5" id="text-4-1-2-2">
<p>
readonly<br  />
</p>
</div>
</li>

<li><a id="sec-4-1-2-3" name="sec-4-1-2-3"></a>The Pros<br  /><div class="outline-text-5" id="text-4-1-2-3">
<p>
The simplicity of having a single URL for all types of access and having the server prompt only when authentication is needed makes things very easy for the end user.<br  />
</p>

<p>
a very fast and efficient protocol similar to the ssh one.<br  />
</p>
</div>
</li>

<li><a id="sec-4-1-2-4" name="sec-4-1-2-4"></a>The Cons<br  /><div class="outline-text-5" id="text-4-1-2-4">
<p>
Git over HTTP/S can a little more tricky to set up compared to SSH on some servers.<br  />
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> The SSH Protocol</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
A common transport protocol for Git when self-hosting is over SSH.<br  />
</p>
</div>
<ol class="org-ol"><li><a id="sec-4-1-3-1" name="sec-4-1-3-1"></a>form<br  /><div class="outline-text-5" id="text-4-1-3-1">
<p>
git clone ssh://user@server/project.git<br  />
or<br  />
git clone user@server:project.git<br  />
</p>
</div>
</li>

<li><a id="sec-4-1-3-2" name="sec-4-1-3-2"></a>The Pros<br  /><div class="outline-text-5" id="text-4-1-3-2">
<p>
First, relatively easy to set up.<br  />
Second, access over SSH is secure.<br  />
Third, like the HTTP/S, Git and Local protocols, SSH is efficient, making the data as compact as possible before transferring it.<br  />
</p>
</div>
</li>

<li><a id="sec-4-1-3-3" name="sec-4-1-3-3"></a>The Cons<br  /><div class="outline-text-5" id="text-4-1-3-3">
<p>
you can't server anonymous access of your repository over it.<br  />
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-4-1-4" class="outline-4">
<h4 id="sec-4-1-4"><span class="section-number-4">4.1.4</span> The Git Protocol</h4>
<div class="outline-text-4" id="text-4-1-4">
<p>
This is a special daemon that comes packaged with Git; it listens on a dedicated port(9418).<br  />
In order for a repository to be served over the Git protocol, you must create the git-daemon-export-ok file - the daemon won't serve a repository without that file in it - but other than that there is no security<br  />
</p>
</div>

<ol class="org-ol"><li><a id="sec-4-1-4-1" name="sec-4-1-4-1"></a>The Pros<br  /><div class="outline-text-5" id="text-4-1-4-1">
<p>
fatest network transfer protocol available.<br  />
</p>
</div>
</li>

<li><a id="sec-4-1-4-2" name="sec-4-1-4-2"></a>The cons<br  /><div class="outline-text-5" id="text-4-1-4-2">
<p>
the lack of authentication.<br  />
</p>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Getting Git on a Server</h3>
<div class="outline-text-3" id="text-4-2">
</div><div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> First, get a bare repository</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
In order to initially set up any Git server, you have to export an existing repository into a new bare repository - a repository that doesn't contain a working directory.<br  />
git clone &#x2013;bare my_project my_project.git<br  />
or<br  />
git init &#x2013;bare<br  />
</p>
</div>
</div>

<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> Second, copy it to a server</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
put the bare repository on a server and set up your protocols.<br  />
</p>

<p>
suppose, the server called git.example.com, store all your Git repository under the /srv/git directory:<br  />
scp -r my_project.git user@git.example.com:/srv/git<br  />
</p>

<p>
At this point, other users who have ssh access to the same server which has read-access to the /srv/git directory can clone your repository:<br  />
git clone user@git.example.com:/srv/git/my_project.git<br  />
</p>

<p>
If a user SSHs into a server and has write access to the /srv/git/my_project.git directory, they will alse automactically have push access.<br  />
</p>

<p>
Git will automatically add group write permissions to a repository properly:<br  />
cd /srv/git/my_project.git<br  />
git init &#x2013;bare &#x2013;shared<br  />
</p>
</div>
</div>

<div id="outline-container-sec-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="section-number-4">4.2.3</span> note</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
to collaborate with a couple of people on a private project, all you need it a SSH sever and a bare repository.<br  />
</p>
</div>
</div>
