latexbooks/pro-git/pro-git.tex

\subsection{The Protocols}
\label{sec:org7ca4f3a}
\subsubsection{Local Protocol}
\label{sec:org27bac3e}
the most basic is the Local Protocol, in which the remote repository is in another directory on disk.\\
\begin{enumerate}
\item When to Use
\label{sec:org93c9e85}
If you have a shared mounted filesystem, then you can clone, push to, and pull from a local file-based repository.\\
\item form
\label{sec:org374e250}
git clone /opt/git/project.git\\
or\\
git clone \url{file:///opt/git/project.git}\\

If you just specify the path, Git tries to use hardlinks or directly copy the files it needs.\\
If youu specify \url{file://}, Git fires up the process that it normally uses to transfer data over a network which is generally a lot less efficient method of transferring the data. The main reason that specify the \url{file://} prefix is if you want a clean copy of the repsitory with extraneous references or objects left out.\\

\item The Pros
\label{sec:orgb222f43}
simple and use existing file permissions and network access.\\

\item The Cons
\label{sec:orge99a739}
shared access is generally more difficult to set up and reach from multiple locations than basic network access.\\
this protocol does not protect the repository against accidental damage.\\
\end{enumerate}


\subsubsection{The Http Protocols}
\label{sec:org356370a}
\begin{enumerate}
\item smart http
\label{sec:org06171a9}
The "smart" http protocol opertates very similarly to the ssh or git protocols but runs over standard http/s prots and can use various http authentication mechanisms.\\
read and write\\

\item dumb http
\label{sec:org0709fb6}
readonly\\

\item The Pros
\label{sec:orgce317dd}
The simplicity of having a single URL for all types of access and having the server prompt only when authentication is needed makes things very easy for the end user.\\

a very fast and efficient protocol similar to the ssh one.\\

\item The Cons
\label{sec:orgcbb7d2e}
Git over HTTP/S can a little more tricky to set up compared to SSH on some servers.\\
\end{enumerate}

\subsubsection{The SSH Protocol}
\label{sec:orgdffaf30}
A common transport protocol for Git when self-hosting is over SSH.\\
\begin{enumerate}
\item form
\label{sec:orgba742c7}
git clone ssh://user@server/project.git\\
or\\
git clone user@server:project.git\\

\item The Pros
\label{sec:org64d09a7}
First, relatively easy to set up.\\
Second, access over SSH is secure.\\
Third, like the HTTP/S, Git and Local protocols, SSH is efficient, making the data as compact as possible before transferring it.\\

\item The Cons
\label{sec:orgf8f6c2b}
you can't server anonymous access of your repository over it.\\
\end{enumerate}

\subsubsection{The Git Protocol}
\label{sec:org3772057}
This is a special daemon that comes packaged with Git; it listens on a dedicated port(9418).\\
In order for a repository to be served over the Git protocol, you must create the git-daemon-export-ok file - the daemon won't serve a repository without that file in it - but other than that there is no security\\

\begin{enumerate}
\item The Pros
\label{sec:org6e6572e}
fatest network transfer protocol available.\\

\item The cons
\label{sec:org7ef0ea4}
the lack of authentication.\\
\end{enumerate}

\subsection{Getting Git on a Server}
\label{sec:org612c15b}
\subsubsection{First, get a bare repository}
\label{sec:org5387e61}
In order to initially set up any Git server, you have to export an existing repository into a new bare repository - a repository that doesn't contain a working directory.\\
git clone --bare my\_project my\_project.git\\
or\\
git init --bare\\

\subsubsection{Second, copy it to a server}
\label{sec:orga28a0bc}
put the bare repository on a server and set up your protocols.\\

suppose, the server called git.example.com, store all your Git repository under the /srv/git directory:\\
scp -r my\_project.git user@git.example.com:/srv/git\\

At this point, other users who have ssh access to the same server which has read-access to the /srv/git directory can clone your repository:\\
git clone user@git.example.com:/srv/git/my\_project.git\\

If a user SSHs into a server and has write access to the /srv/git/my\_project.git directory, they will alse automactically have push access.\\

Git will automatically add group write permissions to a repository properly:\\
cd /srv/git/my\_project.git\\
git init --bare --shared\\

\subsubsection{note}
\label{sec:org5a86826}
to collaborate with a couple of people on a private project, all you need it a SSH sever and a bare repository.\\
