latexbooks/pro-git/pro-git.org
*** Small Setups
One of the most complicated aspects of setting up a Git server is user management.

There are a few ways you can give access to everyone on your team:
First, set up accounts for everybody.
Second, create a single git user on the machine, ask every user who is to have write access to send you an SSH public key, and add that key to the ~/.ssh/authorized_keys file of your new git user.
Third, have your SSH server authenticate from an LDAP server or some other centralized authentication source.

As long as each user can get shell access on the machine, any SSH authentication mechanism you can think of should work.

** Setting Up the Server
sudo adduser git
su git
cd
mkdir .ssh && chmod 700 .ssh
touch .ssh/authorized_keys && chmod 600 .ssh/authorized_keys
cat /tmp/id_rsa.michael.pub >> ~/.ssh/authorized_keys
cd /opt/git
mkdir project.git
cd project.git
git init --bare

You can easily restrict the git user to only doing Git activities with a limited shell tool called git-shell that comes with Git.

cat /etc/shell # see if 'git-shell' is already in there
which git-shell # make sure git-shell is installed on your system
sudo vim /etc/shells # add the path to git-shell

sudo chsh git # enter the path ot git-shell

** Git Daemon
yum install git-daemon

This is common choice for fast, unauthenticated access to your Git data.

git daemon --reuseaddr --base-path=/opt/git/ /opt/git/

--reuseaddr allows the server to restart without waiting for old connections to timeout, --base-path option allows people to clone projects without specifying the entire path, and the path at the end tells the Git daemon where to look for repositories to export.

If you are running a firewall, you will also need to punch a hole in it at port 9418.

cd /path/to/project.git
touch git-daemon-export-ok

** Smart HTTP (not done)

*** Ubuntu
sudo apt-get install apache2 apache2-utils (on Ubuntu)

*** CentOS
yum install httpd
yum install gitweb

chgrp -R apache /home/git/project.git

** GitLab
GitLab is a database-backed web application.

*** Install
**** Install and configure the necessary dependencies

yum install -y curl policycoreutils-python openssh-server
systemctl enable sshd
systemctl start sshd
firewall-cmd --permanent --add-service=http
systemctl reload firewalld 

Next, install Postfix to send notification emails.
yum install postfix
systemctl enable postfix
systemctl start postfix

**** Add the GitLab package repository and intall the package
curl https://packages.gitlab.com/install/repositories/gitlab/gitlab-ee/script.rpm.sh | sudo bash

Next, install the GitLab package. 

sudo EXTERNAL_URL="http://chyson.net" yum install -y gitlab-ee

**** Browse to the hostname and login
On your first visit, you'll be redirected to a password reset screen. Provide the password for the initial administrator account and you will be redirected back to the login screen. Use the default account's username root to login.

