latexbooks/pro-git/pro-git.html


<div id="outline-container-sec-4-2-4" class="outline-4">
<h4 id="sec-4-2-4"><span class="section-number-4">4.2.4</span> Small Setups</h4>
<div class="outline-text-4" id="text-4-2-4">
<p>
One of the most complicated aspects of setting up a Git server is user management.<br  />
</p>

<p>
There are a few ways you can give access to everyone on your team:<br  />
First, set up accounts for everybody.<br  />
Second, create a single git user on the machine, ask every user who is to have write access to send you an SSH public key, and add that key to the ~/.ssh/authorized_keys file of your new git user.<br  />
Third, have your SSH server authenticate from an LDAP server or some other centralized authentication source.<br  />
</p>

<p>
As long as each user can get shell access on the machine, any SSH authentication mechanism you can think of should work.<br  />
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Setting Up the Server</h3>
<div class="outline-text-3" id="text-4-3">
<p>
sudo adduser git<br  />
su git<br  />
cd<br  />
mkdir .ssh &amp;&amp; chmod 700 .ssh<br  />
touch .ssh/authorized_keys &amp;&amp; chmod 600 .ssh/authorized_keys<br  />
cat <i>tmp/id_rsa.michael.pub &gt;&gt; ~</i>.ssh/authorized_keys<br  />
cd /opt/git<br  />
mkdir project.git<br  />
cd project.git<br  />
git init &#x2013;bare<br  />
</p>

<p>
You can easily restrict the git user to only doing Git activities with a limited shell tool called git-shell that comes with Git.<br  />
</p>

<p>
cat /etc/shell # see if 'git-shell' is already in there<br  />
which git-shell # make sure git-shell is installed on your system<br  />
sudo vim /etc/shells # add the path to git-shell<br  />
</p>

<p>
sudo chsh git # enter the path ot git-shell<br  />
</p>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Git Daemon</h3>
<div class="outline-text-3" id="text-4-4">
<p>
yum install git-daemon<br  />
</p>

<p>
This is common choice for fast, unauthenticated access to your Git data.<br  />
</p>

<p>
git daemon &#x2013;reuseaddr &#x2013;base-path=/opt/git/ <i>opt/git</i><br  />
</p>

<p>
&#x2013;reuseaddr allows the server to restart without waiting for old connections to timeout, &#x2013;base-path option allows people to clone projects without specifying the entire path, and the path at the end tells the Git daemon where to look for repositories to export.<br  />
</p>

<p>
If you are running a firewall, you will also need to punch a hole in it at port 9418.<br  />
</p>

<p>
cd /path/to/project.git<br  />
touch git-daemon-export-ok<br  />
</p>
</div>
</div>

<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Smart HTTP (not done)</h3>
<div class="outline-text-3" id="text-4-5">
</div><div id="outline-container-sec-4-5-1" class="outline-4">
<h4 id="sec-4-5-1"><span class="section-number-4">4.5.1</span> Ubuntu</h4>
<div class="outline-text-4" id="text-4-5-1">
<p>
sudo apt-get install apache2 apache2-utils (on Ubuntu)<br  />
</p>
</div>
</div>

<div id="outline-container-sec-4-5-2" class="outline-4">
<h4 id="sec-4-5-2"><span class="section-number-4">4.5.2</span> CentOS</h4>
<div class="outline-text-4" id="text-4-5-2">
<p>
yum install httpd<br  />
yum install gitweb<br  />
</p>

<p>
chgrp -R apache /home/git/project.git<br  />
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> GitLab</h3>
<div class="outline-text-3" id="text-4-6">
<p>
GitLab is a database-backed web application.<br  />
</p>
</div>

<div id="outline-container-sec-4-6-1" class="outline-4">
<h4 id="sec-4-6-1"><span class="section-number-4">4.6.1</span> Install</h4>
<div class="outline-text-4" id="text-4-6-1">
</div><ol class="org-ol"><li><a id="sec-4-6-1-1" name="sec-4-6-1-1"></a>Install and configure the necessary dependencies<br  /><div class="outline-text-5" id="text-4-6-1-1">
<p>
yum install -y curl policycoreutils-python openssh-server<br  />
systemctl enable sshd<br  />
systemctl start sshd<br  />
firewall-cmd &#x2013;permanent &#x2013;add-service=http<br  />
systemctl reload firewalld<br  />
</p>

<p>
Next, install Postfix to send notification emails.<br  />
yum install postfix<br  />
systemctl enable postfix<br  />
systemctl start postfix<br  />
</p>
</div>
</li>

<li><a id="sec-4-6-1-2" name="sec-4-6-1-2"></a>Add the GitLab package repository and intall the package<br  /><div class="outline-text-5" id="text-4-6-1-2">
<p>
curl <a href="https://packages.gitlab.com/install/repositories/gitlab/gitlab-ee/script.rpm.sh">https://packages.gitlab.com/install/repositories/gitlab/gitlab-ee/script.rpm.sh</a> | sudo bash<br  />
</p>

<p>
Next, install the GitLab package.<br  />
</p>

<p>
sudo EXTERNAL_URL="<a href="http://chyson.net">http://chyson.net</a>" yum install -y gitlab-ee<br  />
</p>
</div>
</li>

<li><a id="sec-4-6-1-3" name="sec-4-6-1-3"></a>Browse to the hostname and login<br  /><div class="outline-text-5" id="text-4-6-1-3">
<p>
On your first visit, you'll be redirected to a password reset screen. Provide the password for the initial administrator account and you will be redirected back to the login screen. Use the default account's username root to login.<br  />
</p>
</div>
</li></ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mingming Li</p>
<p class="date">Created: 2019-10-15 Tue 13:56</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
