latexbooks/pro-git/pro-git.tex


\subsubsection{Small Setups}
\label{sec:org107ded2}
One of the most complicated aspects of setting up a Git server is user management.\\

There are a few ways you can give access to everyone on your team:\\
First, set up accounts for everybody.\\
Second, create a single git user on the machine, ask every user who is to have write access to send you an SSH public key, and add that key to the \textasciitilde{}/.ssh/authorized\_keys file of your new git user.\\
Third, have your SSH server authenticate from an LDAP server or some other centralized authentication source.\\

As long as each user can get shell access on the machine, any SSH authentication mechanism you can think of should work.\\

\subsection{Setting Up the Server}
\label{sec:org4400fa1}
sudo adduser git\\
su git\\
cd\\
mkdir .ssh \&\& chmod 700 .ssh\\
touch .ssh/authorized\_keys \&\& chmod 600 .ssh/authorized\_keys\\
cat \emph{tmp/id\_rsa.michael.pub >> \textasciitilde{}}.ssh/authorized\_keys\\
cd /opt/git\\
mkdir project.git\\
cd project.git\\
git init --bare\\

You can easily restrict the git user to only doing Git activities with a limited shell tool called git-shell that comes with Git.\\

cat /etc/shell \# see if 'git-shell' is already in there\\
which git-shell \# make sure git-shell is installed on your system\\
sudo vim /etc/shells \# add the path to git-shell\\

sudo chsh git \# enter the path ot git-shell\\

\subsection{Git Daemon}
\label{sec:org7e5e275}
yum install git-daemon\\

This is common choice for fast, unauthenticated access to your Git data.\\

git daemon --reuseaddr --base-path=/opt/git/ \emph{opt/git}\\

--reuseaddr allows the server to restart without waiting for old connections to timeout, --base-path option allows people to clone projects without specifying the entire path, and the path at the end tells the Git daemon where to look for repositories to export.\\

If you are running a firewall, you will also need to punch a hole in it at port 9418.\\

cd /path/to/project.git\\
touch git-daemon-export-ok\\

\subsection{Smart HTTP (not done)}
\label{sec:org233152b}

\subsubsection{Ubuntu}
\label{sec:org74ad546}
sudo apt-get install apache2 apache2-utils (on Ubuntu)\\

\subsubsection{CentOS}
\label{sec:org83c498f}
yum install httpd\\
yum install gitweb\\

chgrp -R apache /home/git/project.git\\

\subsection{GitLab}
\label{sec:org771cf30}
GitLab is a database-backed web application.\\

\subsubsection{Install}
\label{sec:org9d02813}
\begin{enumerate}
\item Install and configure the necessary dependencies
\label{sec:orgd3b197b}

yum install -y curl policycoreutils-python openssh-server\\
systemctl enable sshd\\
systemctl start sshd\\
firewall-cmd --permanent --add-service=http\\
systemctl reload firewalld\\

Next, install Postfix to send notification emails.\\
yum install postfix\\
systemctl enable postfix\\
systemctl start postfix\\

\item Add the GitLab package repository and intall the package
\label{sec:org48e34f8}
curl \url{https://packages.gitlab.com/install/repositories/gitlab/gitlab-ee/script.rpm.sh} | sudo bash\\

Next, install the GitLab package.\\

sudo EXTERNAL\_URL="\url{http://chyson.net}" yum install -y gitlab-ee\\

\item Browse to the hostname and login
\label{sec:orgd33a62b}
On your first visit, you'll be redirected to a password reset screen. Provide the password for the initial administrator account and you will be redirected back to the login screen. Use the default account's username root to login.\\
\end{enumerate}
\end{document}